{
  "species": {
    "aerodactyl": 1,
    "aerodactylmega": 2,
    "archaludon": 3,
    "basculegion": 4,
    "charizard": 5,
    "charizardmegay": 6,
    "corviknight": 7,
    "dragonite": 8,
    "excadrill": 9,
    "floetteeternal": 10,
    "floetteeternalmega": 11,
    "froslass": 12,
    "froslassmega": 13,
    "garchomp": 14,
    "gengar": 15,
    "gengarmega": 16,
    "glimmora": 17,
    "hydreigon": 18,
    "incineroar": 19,
    "kingambit": 20,
    "kommoo": 21,
    "milotic": 22,
    "mimikyu": 23,
    "pelipper": 24,
    "rotomwash": 25,
    "sableye": 26,
    "scovillain": 27,
    "scovillainmega": 28,
    "sneasler": 29,
    "tyranitar": 30,
    "tyranitarmega": 31,
    "venusaur": 32,
    "venusaurmega": 33,
    "whimsicott": 34
  },
  "items": {
    "aerodactylite": 1,
    "charizarditey": 2,
    "choicescarf": 3,
    "chopleberry": 4,
    "dragonfang": 5,
    "fairyfeather": 6,
    "floettite": 7,
    "focussash": 8,
    "froslassite": 9,
    "gengarite": 10,
    "leftovers": 11,
    "mysticwater": 12,
    "roseliberry": 13,
    "scovillainite": 14,
    "sitrusberry": 15,
    "tyranitarite": 16,
    "venusaurite": 17,
    "whiteherb": 18
  },
  "abilities": {
    "adaptability": 1,
    "blaze": 2,
    "chlorophyll": 3,
    "competitive": 4,
    "cursedbody": 5,
    "defiant": 6,
    "disguise": 7,
    "drizzle": 8,
    "flowerveil": 9,
    "intimidate": 10,
    "levitate": 11,
    "mirrorarmor": 12,
    "moody": 13,
    "multiscale": 14,
    "prankster": 15,
    "roughskin": 16,
    "sandrush": 17,
    "sandstream": 18,
    "soundproof": 19,
    "stamina": 20,
    "toxicdebris": 21,
    "unburden": 22,
    "unnerve": 23
  },
  "moves": {
    "aquajet": 1,
    "aurasphere": 2,
    "auroraveil": 3,
    "blizzard": 4,
    "bravebird": 5,
    "bulkup": 6,
    "calmmind": 7,
    "clangingscales": 8,
    "clangoroussoul": 9,
    "closecombat": 10,
    "darkpulse": 11,
    "dazzlinggleam": 12,
    "direclaw": 13,
    "disable": 14,
    "dracometeor": 15,
    "dragonclaw": 16,
    "dragonpulse": 17,
    "dualwingbeat": 18,
    "earthpower": 19,
    "earthquake": 20,
    "electroshot": 21,
    "encore": 22,
    "extremespeed": 23,
    "fakeout": 24,
    "flareblitz": 25,
    "flashcannon": 26,
    "flipturn": 27,
    "gigadrain": 28,
    "heatwave": 29,
    "hurricane": 30,
    "hydropump": 31,
    "icywind": 32,
    "ironhead": 33,
    "knockoff": 34,
    "kowtowcleave": 35,
    "lastrespects": 36,
    "leechseed": 37,
    "lifedew": 38,
    "liquidation": 39,
    "lowkick": 40,
    "moonblast": 41,
    "overheat": 42,
    "partingshot": 43,
    "playrough": 44,
    "poisonjab": 45,
    "powergem": 46,
    "protect": 47,
    "ragepowder": 48,
    "raindance": 49,
    "recharge": 50,
    "rockslide": 51,
    "roost": 52,
    "scald": 53,
    "shadowball": 54,
    "shadowclaw": 55,
    "shadowsneak": 56,
    "sludgebomb": 57,
    "snarl": 58,
    "solarbeam": 59,
    "spikyshield": 60,
    "struggle": 61,
    "suckerpunch": 62,
    "tailwind": 63,
    "throatchop": 64,
    "thunderbolt": 65,
    "wavecrash": 66,
    "weatherball": 67,
    "wideguard": 68,
    "willowisp": 69
  },
  "volatiles": {
    "confusion": 1,
    "disable": 2,
    "encore": 3,
    "leechseed": 4,
    "substitute": 5,
    "taunt": 6
  },
  "status": {
    "burn": 1,
    "freeze": 2,
    "paralysis": 3,
    "poison": 4,
    "sleep": 5,
    "toxic": 6
  },
  "types": {
    "normal": 1,
    "fire": 2,
    "water": 3,
    "electric": 4,
    "grass": 5,
    "ice": 6,
    "fighting": 7,
    "poison": 8,
    "ground": 9,
    "flying": 10,
    "psychic": 11,
    "bug": 12,
    "rock": 13,
    "ghost": 14,
    "dragon": 15,
    "dark": 16,
    "steel": 17,
    "fairy": 18
  }
}