{
  "species": {
    "aerodactyl": 1,
    "aerodactylmega": 2,
    "archaludon": 3,
    "basculegion": 4,
    "charizard": 5,
    "charizardmegay": 6,
    "corviknight": 7,
    "dragonite": 8,
    "excadrill": 9,
    "floetteeternal": 10,
    "floetteeternalmega": 11,
    "froslass": 12,
    "froslassmega": 13,
    "garchomp": 14,
    "gengar": 15,
    "gengarmega": 16,
    "glimmora": 17,
    "hydreigon": 18,
    "incineroar": 19,
    "kingambit": 20,
    "kommoo": 21,
    "milotic": 22,
    "mimikyu": 23,
    "pelipper": 24,
    "rotomwash": 25,
    "sableye": 26,
    "scovillain": 27,
    "scovillainmega": 28,
    "sneasler": 29,
    "tyranitar": 30,
    "tyranitarmega": 31,
    "venusaur": 32,
    "venusaurmega": 33,
    "whimsicott": 34
  },
  "items": {
    "aerodactylite": 1,
    "charizarditey": 2,
    "choicescarf": 3,
    "chopleberry": 4,
    "dragonfang": 5,
    "fairyfeather": 6,
    "floettite": 7,
    "focussash": 8,
    "froslassite": 9,
    "gengarite": 10,
    "leftovers": 11,
    "mysticwater": 12,
    "roseliberry": 13,
    "scovillainite": 14,
    "sitrusberry": 15,
    "tyranitarite": 16,
    "venusaurite": 17,
    "whiteherb": 18
  },
  "abilities": {
    "adaptability": 1,
    "blaze": 2,
    "chlorophyll": 3,
    "competitive": 4,
    "cursedbody": 5,
    "defiant": 6,
    "disguise": 7,
    "drizzle": 8,
    "flowerveil": 9,
    "intimidate": 10,
    "levitate": 11,
    "mirrorarmor": 12,
    "moody": 13,
    "multiscale": 14,
    "prankster": 15,
    "roughskin": 16,
    "sandrush": 17,
    "sandstream": 18,
    "soundproof": 19,
    "stamina": 20,
    "toxicdebris": 21,
    "unburden": 22,
    "unnerve": 23
  },
  "moves": {
    "aquajet": 1,
    "aurasphere": 2,
    "auroraveil": 3,
    "blizzard": 4,
    "bravebird": 5,
    "bulkup": 6,
    "calmmind": 7,
    "clangingscales": 8,
    "clangoroussoul": 9,
    "closecombat": 10,
    "darkpulse": 11,
    "dazzlinggleam": 12,
    "direclaw": 13,
    "disable": 14,
    "dracometeor": 15,
    "dragonclaw": 16,
    "dragonpulse": 17,
    "dualwingbeat": 18,
    "earthpower": 19,
    "earthquake": 20,
    "electroshot": 21,
    "encore": 22,
    "extremespeed": 23,
    "fakeout": 24,
    "flareblitz": 25,
    "flashcannon": 26,
    "flipturn": 27,
    "gigadrain": 28,
    "heatwave": 29,
    "hurricane": 30,
    "hydropump": 31,
    "icywind": 32,
    "ironhead": 33,
    "knockoff": 34,
    "kowtowcleave": 35,
    "lastrespects": 36,
    "leechseed": 37,
    "lifedew": 38,
    "liquidation": 39,
    "lowkick": 40,
    "moonblast": 41,
    "overheat": 42,
    "partingshot": 43,
    "playrough": 44,
    "poisonjab": 45,
    "powergem": 46,
    "protect": 47,
    "ragepowder": 48,
    "raindance": 49,
    "recharge": 50,
    "rockslide": 51,
    "roost": 52,
    "scald": 53,
    "shadowball": 54,
    "shadowclaw": 55,
    "shadowsneak": 56,
    "sludgebomb": 57,
    "snarl": 58,
    "solarbeam": 59,
    "spikyshield": 60,
    "struggle": 61,
    "suckerpunch": 62,
    "tailwind": 63,
    "throatchop": 64,
    "thunderbolt": 65,
    "wavecrash": 66,
    "weatherball": 67,
    "wideguard": 68,
    "willowisp": 69
  },
  "volatiles": {
    "confusion": 1,
    "disable": 2,
    "encore": 3,
    "leechseed": 4,
    "substitute": 5,
    "taunt": 6
  },
  "status": {
    "burn": 1,
    "freeze": 2,
    "paralysis": 3,
    "poison": 4,
    "sleep": 5,
    "toxic": 6
  },
  "types": {
    "normal": 1,
    "fire": 2,
    "water": 3,
    "electric": 4,
    "grass": 5,
    "ice": 6,
    "fighting": 7,
    "poison": 8,
    "ground": 9,
    "flying": 10,
    "psychic": 11,
    "bug": 12,
    "rock": 13,
    "ghost": 14,
    "dragon": 15,
    "dark": 16,
    "steel": 17,
    "fairy": 18
  },
  "roster": {
    "aerodactyl:aerodactylite:unnerve:dualwingbeat,protect,rockslide,tailwind": 1,
    "archaludon:leftovers:stamina:dragonpulse,electroshot,flashcannon,protect": 2,
    "basculegion:choicescarf:adaptability:aquajet,flipturn,lastrespects,wavecrash": 3,
    "basculegion:focussash:adaptability:aquajet,lastrespects,liquidation,protect": 4,
    "basculegion:focussash:adaptability:aquajet,lastrespects,protect,wavecrash": 5,
    "basculegion:mysticwater:adaptability:aquajet,lastrespects,protect,wavecrash": 6,
    "basculegion:sitrusberry:adaptability:aquajet,lastrespects,protect,wavecrash": 7,
    "charizard:charizarditey:blaze:heatwave,protect,solarbeam,weatherball": 8,
    "corviknight:leftovers:mirrorarmor:bravebird,bulkup,roost,tailwind": 9,
    "dragonite:dragonfang:multiscale:dragonclaw,extremespeed,lowkick,tailwind": 10,
    "excadrill:focussash:sandrush:earthquake,ironhead,protect,rockslide": 11,
    "floetteeternal:floettite:flowerveil:calmmind,dazzlinggleam,moonblast,protect": 12,
    "froslass:froslassite:cursedbody:auroraveil,blizzard,protect,shadowball": 13,
    "garchomp:sitrusberry:roughskin:dragonclaw,earthquake,poisonjab,rockslide": 14,
    "gengar:gengarite:cursedbody:protect,shadowball,sludgebomb,willowisp": 15,
    "glimmora:focussash:toxicdebris:earthpower,powergem,sludgebomb,spikyshield": 16,
    "hydreigon:choicescarf:levitate:darkpulse,dracometeor,heatwave,snarl": 17,
    "incineroar:sitrusberry:intimidate:fakeout,flareblitz,partingshot,throatchop": 18,
    "kingambit:chopleberry:defiant:ironhead,kowtowcleave,protect,suckerpunch": 19,
    "kingambit:chopleberry:defiant:kowtowcleave,lowkick,protect,suckerpunch": 20,
    "kingambit:focussash:defiant:ironhead,lowkick,protect,suckerpunch": 21,
    "kommoo:leftovers:soundproof:aurasphere,clangingscales,clangoroussoul,protect": 22,
    "milotic:sitrusberry:competitive:icywind,lifedew,protect,scald": 23,
    "mimikyu:fairyfeather:disguise:playrough,protect,shadowclaw,shadowsneak": 24,
    "pelipper:sitrusberry:drizzle:hurricane,tailwind,weatherball,wideguard": 25,
    "rotomwash:sitrusberry:levitate:hydropump,protect,thunderbolt,willowisp": 26,
    "sableye:roseliberry:prankster:disable,encore,raindance,willowisp": 27,
    "scovillain:scovillainite:moody:leechseed,overheat,protect,ragepowder": 28,
    "sneasler:whiteherb:unburden:closecombat,direclaw,fakeout,protect": 29,
    "tyranitar:tyranitarite:sandstream:knockoff,lowkick,protect,rockslide": 30,
    "venusaur:venusaurite:chlorophyll:earthpower,gigadrain,protect,sludgebomb": 31,
    "whimsicott:fairyfeather:prankster:encore,moonblast,protect,tailwind": 32
  }
}