{
  "species": {
    "aerodactyl": 1,
    "aerodactylmega": 2,
    "archaludon": 3,
    "azumarill": 4,
    "basculegion": 5,
    "camerupt": 6,
    "cameruptmega": 7,
    "charizard": 8,
    "charizardmegay": 9,
    "corviknight": 10,
    "crabominable": 11,
    "crabominablemega": 12,
    "dragonite": 13,
    "excadrill": 14,
    "farigiraf": 15,
    "floetteeternal": 16,
    "floetteeternalmega": 17,
    "froslass": 18,
    "froslassmega": 19,
    "gallade": 20,
    "garchomp": 21,
    "gengar": 22,
    "gengarmega": 23,
    "glimmora": 24,
    "hydreigon": 25,
    "incineroar": 26,
    "kingambit": 27,
    "kommoo": 28,
    "milotic": 29,
    "mimikyu": 30,
    "pelipper": 31,
    "rotomwash": 32,
    "sableye": 33,
    "scovillain": 34,
    "scovillainmega": 35,
    "sneasler": 36,
    "tyranitar": 37,
    "tyranitarmega": 38,
    "venusaur": 39,
    "venusaurmega": 40,
    "whimsicott": 41
  },
  "items": {
    "aerodactylite": 1,
    "blackglasses": 2,
    "cameruptite": 3,
    "charizarditey": 4,
    "choicescarf": 5,
    "chopleberry": 6,
    "colburberry": 7,
    "crabominite": 8,
    "dragonfang": 9,
    "fairyfeather": 10,
    "floettite": 11,
    "focussash": 12,
    "froslassite": 13,
    "gengarite": 14,
    "leftovers": 15,
    "mysticwater": 16,
    "roseliberry": 17,
    "scovillainite": 18,
    "sitrusberry": 19,
    "tyranitarite": 20,
    "venusaurite": 21,
    "whiteherb": 22
  },
  "abilities": {
    "adaptability": 1,
    "armortail": 2,
    "blaze": 3,
    "chlorophyll": 4,
    "competitive": 5,
    "cursedbody": 6,
    "defiant": 7,
    "disguise": 8,
    "drizzle": 9,
    "drought": 10,
    "flowerveil": 11,
    "hugepower": 12,
    "hypercutter": 13,
    "intimidate": 14,
    "ironfist": 15,
    "levitate": 16,
    "mirrorarmor": 17,
    "moody": 18,
    "multiscale": 19,
    "prankster": 20,
    "roughskin": 21,
    "sandrush": 22,
    "sandstream": 23,
    "shadowtag": 24,
    "sharpness": 25,
    "sheerforce": 26,
    "snowwarning": 27,
    "solidrock": 28,
    "soundproof": 29,
    "spicyspray": 30,
    "stamina": 31,
    "thickfat": 32,
    "toughclaws": 33,
    "toxicdebris": 34,
    "unburden": 35,
    "unnerve": 36
  },
  "moves": {
    "ancientpower": 1,
    "aquajet": 2,
    "aurasphere": 3,
    "auroraveil": 4,
    "blizzard": 5,
    "bravebird": 6,
    "bulkup": 7,
    "calmmind": 8,
    "clangingscales": 9,
    "clangoroussoul": 10,
    "closecombat": 11,
    "darkpulse": 12,
    "dazzlinggleam": 13,
    "direclaw": 14,
    "disable": 15,
    "dracometeor": 16,
    "dragonclaw": 17,
    "dragonpulse": 18,
    "drainpunch": 19,
    "dualwingbeat": 20,
    "earthpower": 21,
    "earthquake": 22,
    "electroshot": 23,
    "encore": 24,
    "extremespeed": 25,
    "fakeout": 26,
    "flareblitz": 27,
    "flashcannon": 28,
    "flipturn": 29,
    "gigadrain": 30,
    "heatwave": 31,
    "helpinghand": 32,
    "hurricane": 33,
    "hydropump": 34,
    "icehammer": 35,
    "icywind": 36,
    "ironhead": 37,
    "knockoff": 38,
    "kowtowcleave": 39,
    "lastrespects": 40,
    "leafblade": 41,
    "leechseed": 42,
    "lifedew": 43,
    "liquidation": 44,
    "lowkick": 45,
    "machpunch": 46,
    "moonblast": 47,
    "overheat": 48,
    "partingshot": 49,
    "playrough": 50,
    "poisonjab": 51,
    "powergem": 52,
    "protect": 53,
    "psychic": 54,
    "psychocut": 55,
    "ragepowder": 56,
    "raindance": 57,
    "recharge": 58,
    "rockslide": 59,
    "roost": 60,
    "sacredsword": 61,
    "scald": 62,
    "shadowball": 63,
    "shadowclaw": 64,
    "shadowsneak": 65,
    "sludgebomb": 66,
    "snarl": 67,
    "solarbeam": 68,
    "spikyshield": 69,
    "struggle": 70,
    "suckerpunch": 71,
    "tailwind": 72,
    "throatchop": 73,
    "thunderbolt": 74,
    "trickroom": 75,
    "wavecrash": 76,
    "weatherball": 77,
    "wideguard": 78,
    "willowisp": 79
  },
  "volatiles": {
    "confusion": 1,
    "disable": 2,
    "encore": 3,
    "leechseed": 4,
    "throatchop": 5
  },
  "status": {
    "burn": 1,
    "freeze": 2,
    "paralysis": 3,
    "poison": 4,
    "sleep": 5,
    "toxic": 6
  },
  "side_conditions": {
    "auroraveil": 1,
    "tailwind": 2
  },
  "weathers": {
    "rain": 1,
    "sand": 2,
    "snow": 3,
    "sun": 4
  },
  "trickroom": {
    "trickroom": 1
  },
  "categories": {
    "physical": 1,
    "special": 2,
    "status": 3
  },
  "types": {
    "normal": 1,
    "fire": 2,
    "water": 3,
    "electric": 4,
    "grass": 5,
    "ice": 6,
    "fighting": 7,
    "poison": 8,
    "ground": 9,
    "flying": 10,
    "psychic": 11,
    "bug": 12,
    "rock": 13,
    "ghost": 14,
    "dragon": 15,
    "dark": 16,
    "steel": 17,
    "fairy": 18
  }
}