{
  "abilities": {
    "adaptability": 1,
    "aerilate": 2,
    "aftermath": 3,
    "airlock": 4,
    "analytic": 5,
    "angerpoint": 6,
    "angershell": 7,
    "anticipation": 8,
    "arenatrap": 9,
    "armortail": 10,
    "aromaveil": 11,
    "asoneglastrier": 12,
    "asonespectrier": 13,
    "aurabreak": 14,
    "baddreams": 15,
    "ballfetch": 16,
    "battery": 17,
    "battlearmor": 18,
    "battlebond": 19,
    "beadsofruin": 20,
    "beastboost": 21,
    "berserk": 22,
    "bigpecks": 23,
    "blaze": 24,
    "bulletproof": 25,
    "cheekpouch": 26,
    "chillingneigh": 27,
    "chlorophyll": 28,
    "clearbody": 29,
    "cloudnine": 30,
    "colorchange": 31,
    "comatose": 32,
    "commander": 33,
    "competitive": 34,
    "compoundeyes": 35,
    "contrary": 36,
    "corrosion": 37,
    "costar": 38,
    "cottondown": 39,
    "cudchew": 40,
    "curiousmedicine": 41,
    "cursedbody": 42,
    "cutecharm": 43,
    "damp": 44,
    "dancer": 45,
    "darkaura": 46,
    "dauntlessshield": 47,
    "dazzling": 48,
    "defeatist": 49,
    "defiant": 50,
    "deltastream": 51,
    "desolateland": 52,
    "disguise": 53,
    "download": 54,
    "dragonize": 55,
    "dragonsmaw": 56,
    "drizzle": 57,
    "drought": 58,
    "dryskin": 59,
    "earlybird": 60,
    "eartheater": 61,
    "eelevate": 62,
    "effectspore": 63,
    "electricsurge": 64,
    "electromorphosis": 65,
    "embodyaspectcornerstone": 66,
    "embodyaspecthearthflame": 67,
    "embodyaspectteal": 68,
    "embodyaspectwellspring": 69,
    "emergencyexit": 70,
    "fairyaura": 71,
    "filter": 72,
    "firemane": 73,
    "flamebody": 74,
    "flareboost": 75,
    "flashfire": 76,
    "flowergift": 77,
    "flowerveil": 78,
    "fluffy": 79,
    "forecast": 80,
    "forewarn": 81,
    "friendguard": 82,
    "frisk": 83,
    "fullmetalbody": 84,
    "furcoat": 85,
    "galewings": 86,
    "galvanize": 87,
    "gluttony": 88,
    "goodasgold": 89,
    "gooey": 90,
    "gorillatactics": 91,
    "grasspelt": 92,
    "grassysurge": 93,
    "grimneigh": 94,
    "guarddog": 95,
    "gulpmissile": 96,
    "guts": 97,
    "hadronengine": 98,
    "harvest": 99,
    "healer": 100,
    "heatproof": 101,
    "heavymetal": 102,
    "honeygather": 103,
    "hospitality": 104,
    "hugepower": 105,
    "hungerswitch": 106,
    "hustle": 107,
    "hydration": 108,
    "hypercutter": 109,
    "icebody": 110,
    "iceface": 111,
    "icescales": 112,
    "illuminate": 113,
    "illusion": 114,
    "immunity": 115,
    "imposter": 116,
    "infiltrator": 117,
    "innardsout": 118,
    "innerfocus": 119,
    "insomnia": 120,
    "intimidate": 121,
    "intrepidsword": 122,
    "ironbarbs": 123,
    "ironfist": 124,
    "justified": 125,
    "keeneye": 126,
    "klutz": 127,
    "leafguard": 128,
    "levitate": 129,
    "libero": 130,
    "lightmetal": 131,
    "lightningrod": 132,
    "limber": 133,
    "lingeringaroma": 134,
    "liquidooze": 135,
    "liquidvoice": 136,
    "longreach": 137,
    "magicbounce": 138,
    "magicguard": 139,
    "magician": 140,
    "magmaarmor": 141,
    "magnetpull": 142,
    "marvelscale": 143,
    "megalauncher": 144,
    "megasol": 145,
    "merciless": 146,
    "mimicry": 147,
    "mindseye": 148,
    "minus": 149,
    "mirrorarmor": 150,
    "mistysurge": 151,
    "moldbreaker": 152,
    "moody": 153,
    "motordrive": 154,
    "mountaineer": 155,
    "moxie": 156,
    "multiscale": 157,
    "multitype": 158,
    "mummy": 159,
    "myceliummight": 160,
    "naturalcure": 161,
    "neuroforce": 162,
    "neutralizinggas": 163,
    "noability": 164,
    "noguard": 165,
    "normalize": 166,
    "oblivious": 167,
    "opportunist": 168,
    "orichalcumpulse": 169,
    "overcoat": 170,
    "overgrow": 171,
    "owntempo": 172,
    "parentalbond": 173,
    "pastelveil": 174,
    "perishbody": 175,
    "persistent": 176,
    "pickpocket": 177,
    "pickup": 178,
    "piercingdrill": 179,
    "pixilate": 180,
    "plus": 181,
    "poisonheal": 182,
    "poisonpoint": 183,
    "poisonpuppeteer": 184,
    "poisontouch": 185,
    "powerconstruct": 186,
    "powerofalchemy": 187,
    "powerspot": 188,
    "prankster": 189,
    "pressure": 190,
    "primordialsea": 191,
    "prismarmor": 192,
    "propellertail": 193,
    "protean": 194,
    "protosynthesis": 195,
    "psychicsurge": 196,
    "punkrock": 197,
    "purepower": 198,
    "purifyingsalt": 199,
    "quarkdrive": 200,
    "queenlymajesty": 201,
    "quickdraw": 202,
    "quickfeet": 203,
    "raindish": 204,
    "rattled": 205,
    "rebound": 206,
    "receiver": 207,
    "reckless": 208,
    "refrigerate": 209,
    "regenerator": 210,
    "ripen": 211,
    "rivalry": 212,
    "rkssystem": 213,
    "rockhead": 214,
    "rockypayload": 215,
    "roughskin": 216,
    "runaway": 217,
    "sandforce": 218,
    "sandrush": 219,
    "sandspit": 220,
    "sandstream": 221,
    "sandveil": 222,
    "sapsipper": 223,
    "schooling": 224,
    "scrappy": 225,
    "screencleaner": 226,
    "seedsower": 227,
    "serenegrace": 228,
    "shadowshield": 229,
    "shadowtag": 230,
    "sharpness": 231,
    "shedskin": 232,
    "sheerforce": 233,
    "shellarmor": 234,
    "shielddust": 235,
    "shieldsdown": 236,
    "simple": 237,
    "skilllink": 238,
    "slowstart": 239,
    "slushrush": 240,
    "sniper": 241,
    "snowcloak": 242,
    "snowwarning": 243,
    "solarpower": 244,
    "solidrock": 245,
    "soulheart": 246,
    "soundproof": 247,
    "speedboost": 248,
    "spicyspray": 249,
    "stakeout": 250,
    "stall": 251,
    "stalwart": 252,
    "stamina": 253,
    "stancechange": 254,
    "static": 255,
    "steadfast": 256,
    "steamengine": 257,
    "steelworker": 258,
    "steelyspirit": 259,
    "stench": 260,
    "stickyhold": 261,
    "stormdrain": 262,
    "strongjaw": 263,
    "sturdy": 264,
    "suctioncups": 265,
    "superluck": 266,
    "supersweetsyrup": 267,
    "supremeoverlord": 268,
    "surgesurfer": 269,
    "swarm": 270,
    "sweetveil": 271,
    "swiftswim": 272,
    "swordofruin": 273,
    "symbiosis": 274,
    "synchronize": 275,
    "tabletsofruin": 276,
    "tangledfeet": 277,
    "tanglinghair": 278,
    "technician": 279,
    "telepathy": 280,
    "teraformzero": 281,
    "terashell": 282,
    "terashift": 283,
    "teravolt": 284,
    "thermalexchange": 285,
    "thickfat": 286,
    "tintedlens": 287,
    "torrent": 288,
    "toughclaws": 289,
    "toxicboost": 290,
    "toxicchain": 291,
    "toxicdebris": 292,
    "trace": 293,
    "transistor": 294,
    "triage": 295,
    "truant": 296,
    "turboblaze": 297,
    "unaware": 298,
    "unburden": 299,
    "unnerve": 300,
    "unseenfist": 301,
    "vesselofruin": 302,
    "victorystar": 303,
    "vitalspirit": 304,
    "voltabsorb": 305,
    "wanderingspirit": 306,
    "waterabsorb": 307,
    "waterbubble": 308,
    "watercompaction": 309,
    "waterveil": 310,
    "weakarmor": 311,
    "wellbakedbody": 312,
    "whitesmoke": 313,
    "wimpout": 314,
    "windpower": 315,
    "windrider": 316,
    "wonderguard": 317,
    "wonderskin": 318,
    "zenmode": 319,
    "zerotohero": 320
  },
  "categories": {
    "physical": 1,
    "special": 2,
    "status": 3
  },
  "items": {
    "abilityshield": 1,
    "abomasite": 2,
    "absolite": 3,
    "absolitez": 4,
    "absorbbulb": 5,
    "adamantcrystal": 6,
    "adamantorb": 7,
    "adrenalineorb": 8,
    "aerodactylite": 9,
    "aggronite": 10,
    "aguavberry": 11,
    "airballoon": 12,
    "alakazite": 13,
    "aloraichiumz": 14,
    "altarianite": 15,
    "ampharosite": 16,
    "apicotberry": 17,
    "armorfossil": 18,
    "aspearberry": 19,
    "assaultvest": 20,
    "audinite": 21,
    "auspiciousarmor": 22,
    "babiriberry": 23,
    "banettite": 24,
    "barbaracite": 25,
    "baxcalibrite": 26,
    "beastball": 27,
    "beedrillite": 28,
    "belueberry": 29,
    "berry": 30,
    "berryjuice": 31,
    "berrysweet": 32,
    "berserkgene": 33,
    "bignugget": 34,
    "bigroot": 35,
    "bindingband": 36,
    "bitterberry": 37,
    "blackbelt": 38,
    "blackglasses": 39,
    "blacksludge": 40,
    "blastoisinite": 41,
    "blazikenite": 42,
    "blueorb": 43,
    "blukberry": 44,
    "blunderpolicy": 45,
    "boosterenergy": 46,
    "bottlecap": 47,
    "brightpowder": 48,
    "buggem": 49,
    "buginiumz": 50,
    "bugmemory": 51,
    "burndrive": 52,
    "burntberry": 53,
    "cameruptite": 54,
    "cellbattery": 55,
    "chandelurite": 56,
    "charcoal": 57,
    "charizarditex": 58,
    "charizarditey": 59,
    "chartiberry": 60,
    "cheriberry": 61,
    "cherishball": 62,
    "chesnaughtite": 63,
    "chestoberry": 64,
    "chilanberry": 65,
    "chilldrive": 66,
    "chimechite": 67,
    "chippedpot": 68,
    "choiceband": 69,
    "choicescarf": 70,
    "choicespecs": 71,
    "chopleberry": 72,
    "clawfossil": 73,
    "clearamulet": 74,
    "clefablite": 75,
    "cloversweet": 76,
    "cobaberry": 77,
    "colburberry": 78,
    "cornerstonemask": 79,
    "cornnberry": 80,
    "coverfossil": 81,
    "covertcloak": 82,
    "crabominite": 83,
    "crackedpot": 84,
    "crucibellite": 85,
    "custapberry": 86,
    "damprock": 87,
    "darkgem": 88,
    "darkiniumz": 89,
    "darkmemory": 90,
    "darkranite": 91,
    "dawnstone": 92,
    "decidiumz": 93,
    "deepseascale": 94,
    "deepseatooth": 95,
    "delphoxite": 96,
    "destinyknot": 97,
    "diancite": 98,
    "diveball": 99,
    "domefossil": 100,
    "dousedrive": 101,
    "dracoplate": 102,
    "dragalgite": 103,
    "dragonfang": 104,
    "dragongem": 105,
    "dragoninite": 106,
    "dragoniumz": 107,
    "dragonmemory": 108,
    "dragonscale": 109,
    "drampanite": 110,
    "dreadplate": 111,
    "dreamball": 112,
    "dubiousdisc": 113,
    "durinberry": 114,
    "duskball": 115,
    "duskstone": 116,
    "earthplate": 117,
    "eelektrossite": 118,
    "eeviumz": 119,
    "ejectbutton": 120,
    "ejectpack": 121,
    "electirizer": 122,
    "electricgem": 123,
    "electricmemory": 124,
    "electricseed": 125,
    "electriumz": 126,
    "emboarite": 127,
    "enigmaberry": 128,
    "eviolite": 129,
    "excadrite": 130,
    "expertbelt": 131,
    "fairiumz": 132,
    "fairyfeather": 133,
    "fairygem": 134,
    "fairymemory": 135,
    "falinksite": 136,
    "fastball": 137,
    "feraligite": 138,
    "fightinggem": 139,
    "fightingmemory": 140,
    "fightiniumz": 141,
    "figyberry": 142,
    "firegem": 143,
    "firememory": 144,
    "firestone": 145,
    "firiumz": 146,
    "fistplate": 147,
    "flameorb": 148,
    "flameplate": 149,
    "floatstone": 150,
    "floettite": 151,
    "flowersweet": 152,
    "flyinggem": 153,
    "flyingmemory": 154,
    "flyiniumz": 155,
    "focusband": 156,
    "focussash": 157,
    "fossilizedbird": 158,
    "fossilizeddino": 159,
    "fossilizeddrake": 160,
    "fossilizedfish": 161,
    "friendball": 162,
    "froslassite": 163,
    "fullincense": 164,
    "galaricacuff": 165,
    "galaricawreath": 166,
    "galladite": 167,
    "ganlonberry": 168,
    "garchompite": 169,
    "garchompitez": 170,
    "gardevoirite": 171,
    "gengarite": 172,
    "ghostgem": 173,
    "ghostiumz": 174,
    "ghostmemory": 175,
    "glalitite": 176,
    "glimmoranite": 177,
    "goldberry": 178,
    "goldbottlecap": 179,
    "golisopite": 180,
    "golurkite": 181,
    "grassgem": 182,
    "grassiumz": 183,
    "grassmemory": 184,
    "grassyseed": 185,
    "greatball": 186,
    "greninjite": 187,
    "grepaberry": 188,
    "gripclaw": 189,
    "griseouscore": 190,
    "griseousorb": 191,
    "groundgem": 192,
    "groundiumz": 193,
    "groundmemory": 194,
    "gyaradosite": 195,
    "habanberry": 196,
    "hardstone": 197,
    "hawluchanite": 198,
    "healball": 199,
    "hearthflamemask": 200,
    "heatranite": 201,
    "heatrock": 202,
    "heavyball": 203,
    "heavydutyboots": 204,
    "helixfossil": 205,
    "heracronite": 206,
    "hondewberry": 207,
    "houndoominite": 208,
    "iapapaberry": 209,
    "iceberry": 210,
    "icegem": 211,
    "icememory": 212,
    "icestone": 213,
    "icicleplate": 214,
    "iciumz": 215,
    "icyrock": 216,
    "inciniumz": 217,
    "insectplate": 218,
    "ironball": 219,
    "ironplate": 220,
    "jabocaberry": 221,
    "jawfossil": 222,
    "kangaskhanite": 223,
    "kasibberry": 224,
    "kebiaberry": 225,
    "keeberry": 226,
    "kelpsyberry": 227,
    "kingsrock": 228,
    "kommoniumz": 229,
    "laggingtail": 230,
    "lansatberry": 231,
    "latiasite": 232,
    "latiosite": 233,
    "laxincense": 234,
    "leafstone": 235,
    "leek": 236,
    "leftovers": 237,
    "leppaberry": 238,
    "levelball": 239,
    "liechiberry": 240,
    "lifeorb": 241,
    "lightball": 242,
    "lightclay": 243,
    "loadeddice": 244,
    "lopunnite": 245,
    "loveball": 246,
    "lovesweet": 247,
    "lucarionite": 248,
    "lucarionitez": 249,
    "luckypunch": 250,
    "lumberry": 251,
    "luminousmoss": 252,
    "lunaliumz": 253,
    "lureball": 254,
    "lustrousglobe": 255,
    "lustrousorb": 256,
    "luxuryball": 257,
    "lycaniumz": 258,
    "machobrace": 259,
    "magearnite": 260,
    "magmarizer": 261,
    "magnet": 262,
    "magoberry": 263,
    "magostberry": 264,
    "mail": 265,
    "malamarite": 266,
    "maliciousarmor": 267,
    "manectite": 268,
    "marangaberry": 269,
    "marshadiumz": 270,
    "masterball": 271,
    "masterpieceteacup": 272,
    "mawilite": 273,
    "meadowplate": 274,
    "medichamite": 275,
    "meganiumite": 276,
    "mentalherb": 277,
    "meowsticite": 278,
    "metagrossite": 279,
    "metalalloy": 280,
    "metalcoat": 281,
    "metalpowder": 282,
    "metronome": 283,
    "mewniumz": 284,
    "mewtwonitex": 285,
    "mewtwonitey": 286,
    "micleberry": 287,
    "mimikiumz": 288,
    "mindplate": 289,
    "mintberry": 290,
    "miracleberry": 291,
    "miracleseed": 292,
    "mirrorherb": 293,
    "mistyseed": 294,
    "moonball": 295,
    "moonstone": 296,
    "muscleband": 297,
    "mysteryberry": 298,
    "mysticwater": 299,
    "nanabberry": 300,
    "nestball": 301,
    "netball": 302,
    "nevermeltice": 303,
    "nomelberry": 304,
    "normalgem": 305,
    "normaliumz": 306,
    "occaberry": 307,
    "oddincense": 308,
    "oldamber": 309,
    "oranberry": 310,
    "ovalstone": 311,
    "pamtreberry": 312,
    "parkball": 313,
    "passhoberry": 314,
    "payapaberry": 315,
    "pechaberry": 316,
    "persimberry": 317,
    "petayaberry": 318,
    "pidgeotite": 319,
    "pikaniumz": 320,
    "pikashuniumz": 321,
    "pinapberry": 322,
    "pinkbow": 323,
    "pinsirite": 324,
    "pixieplate": 325,
    "plumefossil": 326,
    "poisonbarb": 327,
    "poisongem": 328,
    "poisoniumz": 329,
    "poisonmemory": 330,
    "pokeball": 331,
    "polkadotbow": 332,
    "pomegberry": 333,
    "poweranklet": 334,
    "powerband": 335,
    "powerbelt": 336,
    "powerbracer": 337,
    "powerherb": 338,
    "powerlens": 339,
    "powerweight": 340,
    "premierball": 341,
    "prettyfeather": 342,
    "primariumz": 343,
    "prismscale": 344,
    "protectivepads": 345,
    "protector": 346,
    "przcureberry": 347,
    "psncureberry": 348,
    "psychicgem": 349,
    "psychicmemory": 350,
    "psychicseed": 351,
    "psychiumz": 352,
    "punchingglove": 353,
    "pyroarite": 354,
    "qualotberry": 355,
    "quickball": 356,
    "quickclaw": 357,
    "quickpowder": 358,
    "rabutaberry": 359,
    "raichunitex": 360,
    "raichunitey": 361,
    "rarebone": 362,
    "rawstberry": 363,
    "razorclaw": 364,
    "razorfang": 365,
    "razzberry": 366,
    "reapercloth": 367,
    "redcard": 368,
    "redorb": 369,
    "repeatball": 370,
    "ribbonsweet": 371,
    "rindoberry": 372,
    "ringtarget": 373,
    "rockgem": 374,
    "rockincense": 375,
    "rockiumz": 376,
    "rockmemory": 377,
    "rockyhelmet": 378,
    "roomservice": 379,
    "rootfossil": 380,
    "roseincense": 381,
    "roseliberry": 382,
    "rowapberry": 383,
    "rustedshield": 384,
    "rustedsword": 385,
    "sablenite": 386,
    "sachet": 387,
    "safariball": 388,
    "safetygoggles": 389,
    "sailfossil": 390,
    "salacberry": 391,
    "salamencite": 392,
    "sceptilite": 393,
    "scizorite": 394,
    "scolipite": 395,
    "scopelens": 396,
    "scovillainite": 397,
    "scraftinite": 398,
    "seaincense": 399,
    "sharpbeak": 400,
    "sharpedonite": 401,
    "shedshell": 402,
    "shellbell": 403,
    "shinystone": 404,
    "shockdrive": 405,
    "shucaberry": 406,
    "silkscarf": 407,
    "silverpowder": 408,
    "sitrusberry": 409,
    "skarmorite": 410,
    "skullfossil": 411,
    "skyplate": 412,
    "slowbronite": 413,
    "smoothrock": 414,
    "snorliumz": 415,
    "snowball": 416,
    "softsand": 417,
    "solganiumz": 418,
    "souldew": 419,
    "spelltag": 420,
    "spelonberry": 421,
    "splashplate": 422,
    "spookyplate": 423,
    "sportball": 424,
    "staraptite": 425,
    "starfberry": 426,
    "starminite": 427,
    "starsweet": 428,
    "steelgem": 429,
    "steeliumz": 430,
    "steelixite": 431,
    "steelmemory": 432,
    "stick": 433,
    "stickybarb": 434,
    "stoneplate": 435,
    "strangeball": 436,
    "strawberrysweet": 437,
    "sunstone": 438,
    "swampertite": 439,
    "sweetapple": 440,
    "syrupyapple": 441,
    "tamatoberry": 442,
    "tangaberry": 443,
    "tapuniumz": 444,
    "tartapple": 445,
    "tatsugirinite": 446,
    "terrainextender": 447,
    "thickclub": 448,
    "throatspray": 449,
    "thunderstone": 450,
    "timerball": 451,
    "toxicorb": 452,
    "toxicplate": 453,
    "tr00": 454,
    "tr01": 455,
    "tr02": 456,
    "tr03": 457,
    "tr04": 458,
    "tr05": 459,
    "tr06": 460,
    "tr07": 461,
    "tr08": 462,
    "tr09": 463,
    "tr10": 464,
    "tr11": 465,
    "tr12": 466,
    "tr13": 467,
    "tr14": 468,
    "tr15": 469,
    "tr16": 470,
    "tr17": 471,
    "tr18": 472,
    "tr19": 473,
    "tr20": 474,
    "tr21": 475,
    "tr22": 476,
    "tr23": 477,
    "tr24": 478,
    "tr25": 479,
    "tr26": 480,
    "tr27": 481,
    "tr28": 482,
    "tr29": 483,
    "tr30": 484,
    "tr31": 485,
    "tr32": 486,
    "tr33": 487,
    "tr34": 488,
    "tr35": 489,
    "tr36": 490,
    "tr37": 491,
    "tr38": 492,
    "tr39": 493,
    "tr40": 494,
    "tr41": 495,
    "tr42": 496,
    "tr43": 497,
    "tr44": 498,
    "tr45": 499,
    "tr46": 500,
    "tr47": 501,
    "tr48": 502,
    "tr49": 503,
    "tr50": 504,
    "tr51": 505,
    "tr52": 506,
    "tr53": 507,
    "tr54": 508,
    "tr55": 509,
    "tr56": 510,
    "tr57": 511,
    "tr58": 512,
    "tr59": 513,
    "tr60": 514,
    "tr61": 515,
    "tr62": 516,
    "tr63": 517,
    "tr64": 518,
    "tr65": 519,
    "tr66": 520,
    "tr67": 521,
    "tr68": 522,
    "tr69": 523,
    "tr70": 524,
    "tr71": 525,
    "tr72": 526,
    "tr73": 527,
    "tr74": 528,
    "tr75": 529,
    "tr76": 530,
    "tr77": 531,
    "tr78": 532,
    "tr79": 533,
    "tr80": 534,
    "tr81": 535,
    "tr82": 536,
    "tr83": 537,
    "tr84": 538,
    "tr85": 539,
    "tr86": 540,
    "tr87": 541,
    "tr88": 542,
    "tr89": 543,
    "tr90": 544,
    "tr91": 545,
    "tr92": 546,
    "tr93": 547,
    "tr94": 548,
    "tr95": 549,
    "tr96": 550,
    "tr97": 551,
    "tr98": 552,
    "tr99": 553,
    "twistedspoon": 554,
    "tyranitarite": 555,
    "ultraball": 556,
    "ultranecroziumz": 557,
    "unremarkableteacup": 558,
    "upgrade": 559,
    "utilityumbrella": 560,
    "venusaurite": 561,
    "victreebelite": 562,
    "vilevial": 563,
    "wacanberry": 564,
    "watergem": 565,
    "wateriumz": 566,
    "watermemory": 567,
    "waterstone": 568,
    "watmelberry": 569,
    "waveincense": 570,
    "weaknesspolicy": 571,
    "wellspringmask": 572,
    "wepearberry": 573,
    "whippeddream": 574,
    "whiteherb": 575,
    "widelens": 576,
    "wikiberry": 577,
    "wiseglasses": 578,
    "yacheberry": 579,
    "zapplate": 580,
    "zeraorite": 581,
    "zoomlens": 582,
    "zygardite": 583
  },
  "moves": {
    "10000000voltthunderbolt": 1,
    "absorb": 2,
    "accelerock": 3,
    "acid": 4,
    "acidarmor": 5,
    "aciddownpour": 6,
    "acidspray": 7,
    "acrobatics": 8,
    "acupressure": 9,
    "aerialace": 10,
    "aeroblast": 11,
    "afteryou": 12,
    "agility": 13,
    "aircutter": 14,
    "airslash": 15,
    "alloutpummeling": 16,
    "alluringvoice": 17,
    "allyswitch": 18,
    "amnesia": 19,
    "anchorshot": 20,
    "ancientpower": 21,
    "appleacid": 22,
    "aquacutter": 23,
    "aquajet": 24,
    "aquaring": 25,
    "aquastep": 26,
    "aquatail": 27,
    "armorcannon": 28,
    "armthrust": 29,
    "aromatherapy": 30,
    "aromaticmist": 31,
    "assist": 32,
    "assurance": 33,
    "astonish": 34,
    "astralbarrage": 35,
    "attackorder": 36,
    "attract": 37,
    "aurasphere": 38,
    "aurawheel": 39,
    "aurorabeam": 40,
    "auroraveil": 41,
    "autotomize": 42,
    "avalanche": 43,
    "axekick": 44,
    "babydolleyes": 45,
    "baddybad": 46,
    "banefulbunker": 47,
    "barbbarrage": 48,
    "barrage": 49,
    "barrier": 50,
    "batonpass": 51,
    "beakblast": 52,
    "beatup": 53,
    "behemothbash": 54,
    "behemothblade": 55,
    "belch": 56,
    "bellydrum": 57,
    "bestow": 58,
    "bide": 59,
    "bind": 60,
    "bite": 61,
    "bitterblade": 62,
    "bittermalice": 63,
    "blackholeeclipse": 64,
    "blastburn": 65,
    "blazekick": 66,
    "blazingtorque": 67,
    "bleakwindstorm": 68,
    "blizzard": 69,
    "block": 70,
    "bloodmoon": 71,
    "bloomdoom": 72,
    "blueflare": 73,
    "bodypress": 74,
    "bodyslam": 75,
    "boltbeak": 76,
    "boltstrike": 77,
    "boneclub": 78,
    "bonemerang": 79,
    "bonerush": 80,
    "boomburst": 81,
    "bounce": 82,
    "bouncybubble": 83,
    "branchpoke": 84,
    "bravebird": 85,
    "breakingswipe": 86,
    "breakneckblitz": 87,
    "brickbreak": 88,
    "brine": 89,
    "brutalswing": 90,
    "bubble": 91,
    "bubblebeam": 92,
    "bugbite": 93,
    "bugbuzz": 94,
    "bulkup": 95,
    "bulldoze": 96,
    "bulletpunch": 97,
    "bulletseed": 98,
    "burningbulwark": 99,
    "burningjealousy": 100,
    "burnup": 101,
    "buzzybuzz": 102,
    "calmmind": 103,
    "camouflage": 104,
    "captivate": 105,
    "catastropika": 106,
    "ceaselessedge": 107,
    "celebrate": 108,
    "charge": 109,
    "chargebeam": 110,
    "charm": 111,
    "chatter": 112,
    "chillingwater": 113,
    "chillyreception": 114,
    "chipaway": 115,
    "chloroblast": 116,
    "circlethrow": 117,
    "clamp": 118,
    "clangingscales": 119,
    "clangoroussoul": 120,
    "clangoroussoulblaze": 121,
    "clearsmog": 122,
    "closecombat": 123,
    "coaching": 124,
    "coil": 125,
    "collisioncourse": 126,
    "combattorque": 127,
    "cometpunch": 128,
    "comeuppance": 129,
    "confide": 130,
    "confuseray": 131,
    "confusion": 132,
    "constrict": 133,
    "continentalcrush": 134,
    "conversion": 135,
    "conversion2": 136,
    "copycat": 137,
    "coreenforcer": 138,
    "corkscrewcrash": 139,
    "corrosivegas": 140,
    "cosmicpower": 141,
    "cottonguard": 142,
    "cottonspore": 143,
    "counter": 144,
    "courtchange": 145,
    "covet": 146,
    "crabhammer": 147,
    "craftyshield": 148,
    "crosschop": 149,
    "crosspoison": 150,
    "crunch": 151,
    "crushclaw": 152,
    "crushgrip": 153,
    "curse": 154,
    "cut": 155,
    "darkestlariat": 156,
    "darkpulse": 157,
    "darkvoid": 158,
    "dazzlinggleam": 159,
    "decorate": 160,
    "defendorder": 161,
    "defensecurl": 162,
    "defog": 163,
    "destinybond": 164,
    "detect": 165,
    "devastatingdrake": 166,
    "diamondstorm": 167,
    "dig": 168,
    "direclaw": 169,
    "disable": 170,
    "disarmingvoice": 171,
    "discharge": 172,
    "dive": 173,
    "dizzypunch": 174,
    "doodle": 175,
    "doomdesire": 176,
    "doubleedge": 177,
    "doublehit": 178,
    "doubleironbash": 179,
    "doublekick": 180,
    "doubleshock": 181,
    "doubleslap": 182,
    "doubleteam": 183,
    "dracometeor": 184,
    "dragonascent": 185,
    "dragonbreath": 186,
    "dragoncheer": 187,
    "dragonclaw": 188,
    "dragondance": 189,
    "dragondarts": 190,
    "dragonenergy": 191,
    "dragonhammer": 192,
    "dragonpulse": 193,
    "dragonrage": 194,
    "dragonrush": 195,
    "dragontail": 196,
    "drainingkiss": 197,
    "drainpunch": 198,
    "dreameater": 199,
    "drillpeck": 200,
    "drillrun": 201,
    "drumbeating": 202,
    "dualchop": 203,
    "dualwingbeat": 204,
    "dynamaxcannon": 205,
    "dynamicpunch": 206,
    "earthpower": 207,
    "earthquake": 208,
    "echoedvoice": 209,
    "eerieimpulse": 210,
    "eeriespell": 211,
    "eggbomb": 212,
    "electricterrain": 213,
    "electrify": 214,
    "electroball": 215,
    "electrodrift": 216,
    "electroshot": 217,
    "electroweb": 218,
    "embargo": 219,
    "ember": 220,
    "encore": 221,
    "endeavor": 222,
    "endure": 223,
    "energyball": 224,
    "entrainment": 225,
    "eruption": 226,
    "esperwing": 227,
    "eternabeam": 228,
    "expandingforce": 229,
    "explosion": 230,
    "extrasensory": 231,
    "extremeevoboost": 232,
    "extremespeed": 233,
    "facade": 234,
    "fairylock": 235,
    "fairywind": 236,
    "fakeout": 237,
    "faketears": 238,
    "falsesurrender": 239,
    "falseswipe": 240,
    "featherdance": 241,
    "feint": 242,
    "feintattack": 243,
    "fellstinger": 244,
    "ficklebeam": 245,
    "fierydance": 246,
    "fierywrath": 247,
    "filletaway": 248,
    "finalgambit": 249,
    "fireblast": 250,
    "firefang": 251,
    "firelash": 252,
    "firepledge": 253,
    "firepunch": 254,
    "firespin": 255,
    "firstimpression": 256,
    "fishiousrend": 257,
    "fissure": 258,
    "flail": 259,
    "flameburst": 260,
    "flamecharge": 261,
    "flamethrower": 262,
    "flamewheel": 263,
    "flareblitz": 264,
    "flash": 265,
    "flashcannon": 266,
    "flatter": 267,
    "fleurcannon": 268,
    "fling": 269,
    "flipturn": 270,
    "floatyfall": 271,
    "floralhealing": 272,
    "flowershield": 273,
    "flowertrick": 274,
    "fly": 275,
    "flyingpress": 276,
    "focusblast": 277,
    "focusenergy": 278,
    "focuspunch": 279,
    "followme": 280,
    "forcepalm": 281,
    "foresight": 282,
    "forestscurse": 283,
    "foulplay": 284,
    "freezedry": 285,
    "freezeshock": 286,
    "freezingglare": 287,
    "freezyfrost": 288,
    "frenzyplant": 289,
    "frostbreath": 290,
    "frustration": 291,
    "furyattack": 292,
    "furycutter": 293,
    "furyswipes": 294,
    "fusionbolt": 295,
    "fusionflare": 296,
    "futuresight": 297,
    "gastroacid": 298,
    "geargrind": 299,
    "gearup": 300,
    "genesissupernova": 301,
    "geomancy": 302,
    "gigadrain": 303,
    "gigaimpact": 304,
    "gigatonhammer": 305,
    "gigavolthavoc": 306,
    "glaciallance": 307,
    "glaciate": 308,
    "glaiverush": 309,
    "glare": 310,
    "glitzyglow": 311,
    "gmaxbefuddle": 312,
    "gmaxcannonade": 313,
    "gmaxcentiferno": 314,
    "gmaxchistrike": 315,
    "gmaxcuddle": 316,
    "gmaxdepletion": 317,
    "gmaxdrumsolo": 318,
    "gmaxfinale": 319,
    "gmaxfireball": 320,
    "gmaxfoamburst": 321,
    "gmaxgoldrush": 322,
    "gmaxgravitas": 323,
    "gmaxhydrosnipe": 324,
    "gmaxmalodor": 325,
    "gmaxmeltdown": 326,
    "gmaxoneblow": 327,
    "gmaxrapidflow": 328,
    "gmaxreplenish": 329,
    "gmaxresonance": 330,
    "gmaxsandblast": 331,
    "gmaxsmite": 332,
    "gmaxsnooze": 333,
    "gmaxsteelsurge": 334,
    "gmaxstonesurge": 335,
    "gmaxstunshock": 336,
    "gmaxsweetness": 337,
    "gmaxtartness": 338,
    "gmaxterror": 339,
    "gmaxvinelash": 340,
    "gmaxvolcalith": 341,
    "gmaxvoltcrash": 342,
    "gmaxwildfire": 343,
    "gmaxwindrage": 344,
    "grassknot": 345,
    "grasspledge": 346,
    "grasswhistle": 347,
    "grassyglide": 348,
    "grassyterrain": 349,
    "gravapple": 350,
    "gravity": 351,
    "growl": 352,
    "growth": 353,
    "grudge": 354,
    "guardianofalola": 355,
    "guardsplit": 356,
    "guardswap": 357,
    "guillotine": 358,
    "gunkshot": 359,
    "gust": 360,
    "gyroball": 361,
    "hail": 362,
    "hammerarm": 363,
    "happyhour": 364,
    "harden": 365,
    "hardpress": 366,
    "haze": 367,
    "headbutt": 368,
    "headcharge": 369,
    "headlongrush": 370,
    "headsmash": 371,
    "healbell": 372,
    "healblock": 373,
    "healingwish": 374,
    "healorder": 375,
    "healpulse": 376,
    "heartstamp": 377,
    "heartswap": 378,
    "heatcrash": 379,
    "heatwave": 380,
    "heavyslam": 381,
    "helpinghand": 382,
    "hex": 383,
    "hiddenpower": 384,
    "highhorsepower": 385,
    "highjumpkick": 386,
    "holdback": 387,
    "holdhands": 388,
    "honeclaws": 389,
    "hornattack": 390,
    "horndrill": 391,
    "hornleech": 392,
    "howl": 393,
    "hurricane": 394,
    "hydrocannon": 395,
    "hydropump": 396,
    "hydrosteam": 397,
    "hydrovortex": 398,
    "hyperbeam": 399,
    "hyperdrill": 400,
    "hyperfang": 401,
    "hyperspacefury": 402,
    "hyperspacehole": 403,
    "hypervoice": 404,
    "hypnosis": 405,
    "iceball": 406,
    "icebeam": 407,
    "iceburn": 408,
    "icefang": 409,
    "icehammer": 410,
    "icepunch": 411,
    "iceshard": 412,
    "icespinner": 413,
    "iciclecrash": 414,
    "iciclespear": 415,
    "icywind": 416,
    "imprison": 417,
    "incinerate": 418,
    "infernalparade": 419,
    "inferno": 420,
    "infernooverdrive": 421,
    "infestation": 422,
    "ingrain": 423,
    "instruct": 424,
    "iondeluge": 425,
    "irondefense": 426,
    "ironhead": 427,
    "irontail": 428,
    "ivycudgel": 429,
    "jawlock": 430,
    "jetpunch": 431,
    "judgment": 432,
    "jumpkick": 433,
    "junglehealing": 434,
    "karatechop": 435,
    "kinesis": 436,
    "kingsshield": 437,
    "knockoff": 438,
    "kowtowcleave": 439,
    "landswrath": 440,
    "laserfocus": 441,
    "lashout": 442,
    "lastresort": 443,
    "lastrespects": 444,
    "lavaplume": 445,
    "leafage": 446,
    "leafblade": 447,
    "leafstorm": 448,
    "leaftornado": 449,
    "leechlife": 450,
    "leechseed": 451,
    "leer": 452,
    "letssnuggleforever": 453,
    "lick": 454,
    "lifedew": 455,
    "lightofruin": 456,
    "lightscreen": 457,
    "lightthatburnsthesky": 458,
    "liquidation": 459,
    "lockon": 460,
    "lovelykiss": 461,
    "lowkick": 462,
    "lowsweep": 463,
    "luckychant": 464,
    "luminacrash": 465,
    "lunarblessing": 466,
    "lunardance": 467,
    "lunge": 468,
    "lusterpurge": 469,
    "machpunch": 470,
    "magicalleaf": 471,
    "magicaltorque": 472,
    "magiccoat": 473,
    "magicpowder": 474,
    "magicroom": 475,
    "magmastorm": 476,
    "magnetbomb": 477,
    "magneticflux": 478,
    "magnetrise": 479,
    "magnitude": 480,
    "makeitrain": 481,
    "maliciousmoonsault": 482,
    "malignantchain": 483,
    "matblock": 484,
    "matchagotcha": 485,
    "maxairstream": 486,
    "maxdarkness": 487,
    "maxflare": 488,
    "maxflutterby": 489,
    "maxgeyser": 490,
    "maxguard": 491,
    "maxhailstorm": 492,
    "maxknuckle": 493,
    "maxlightning": 494,
    "maxmindstorm": 495,
    "maxooze": 496,
    "maxovergrowth": 497,
    "maxphantasm": 498,
    "maxquake": 499,
    "maxrockfall": 500,
    "maxstarfall": 501,
    "maxsteelspike": 502,
    "maxstrike": 503,
    "maxwyrmwind": 504,
    "meanlook": 505,
    "meditate": 506,
    "mefirst": 507,
    "megadrain": 508,
    "megahorn": 509,
    "megakick": 510,
    "megapunch": 511,
    "memento": 512,
    "menacingmoonrazemaelstrom": 513,
    "metalburst": 514,
    "metalclaw": 515,
    "metalsound": 516,
    "meteorassault": 517,
    "meteorbeam": 518,
    "meteormash": 519,
    "metronome": 520,
    "mightycleave": 521,
    "milkdrink": 522,
    "mimic": 523,
    "mindblown": 524,
    "mindreader": 525,
    "minimize": 526,
    "miracleeye": 527,
    "mirrorcoat": 528,
    "mirrormove": 529,
    "mirrorshot": 530,
    "mist": 531,
    "mistball": 532,
    "mistyexplosion": 533,
    "mistyterrain": 534,
    "moonblast": 535,
    "moongeistbeam": 536,
    "moonlight": 537,
    "morningsun": 538,
    "mortalspin": 539,
    "mountaingale": 540,
    "mudbomb": 541,
    "muddywater": 542,
    "mudshot": 543,
    "mudslap": 544,
    "mudsport": 545,
    "multiattack": 546,
    "mysticalfire": 547,
    "mysticalpower": 548,
    "nastyplot": 549,
    "naturalgift": 550,
    "naturepower": 551,
    "naturesmadness": 552,
    "needlearm": 553,
    "neverendingnightmare": 554,
    "nightdaze": 555,
    "nightmare": 556,
    "nightshade": 557,
    "nightslash": 558,
    "nihillight": 559,
    "nobleroar": 560,
    "noretreat": 561,
    "noxioustorque": 562,
    "nuzzle": 563,
    "oblivionwing": 564,
    "obstruct": 565,
    "oceanicoperetta": 566,
    "octazooka": 567,
    "octolock": 568,
    "odorsleuth": 569,
    "ominouswind": 570,
    "orderup": 571,
    "originpulse": 572,
    "outrage": 573,
    "overdrive": 574,
    "overheat": 575,
    "painsplit": 576,
    "paleowave": 577,
    "paraboliccharge": 578,
    "partingshot": 579,
    "payback": 580,
    "payday": 581,
    "peck": 582,
    "perishsong": 583,
    "petalblizzard": 584,
    "petaldance": 585,
    "phantomforce": 586,
    "photongeyser": 587,
    "pikapapow": 588,
    "pinmissile": 589,
    "plasmafists": 590,
    "playnice": 591,
    "playrough": 592,
    "pluck": 593,
    "poisonfang": 594,
    "poisongas": 595,
    "poisonjab": 596,
    "poisonpowder": 597,
    "poisonsting": 598,
    "poisontail": 599,
    "polarflare": 600,
    "pollenpuff": 601,
    "poltergeist": 602,
    "populationbomb": 603,
    "pounce": 604,
    "pound": 605,
    "powder": 606,
    "powdersnow": 607,
    "powergem": 608,
    "powershift": 609,
    "powersplit": 610,
    "powerswap": 611,
    "powertrick": 612,
    "powertrip": 613,
    "poweruppunch": 614,
    "powerwhip": 615,
    "precipiceblades": 616,
    "present": 617,
    "prismaticlaser": 618,
    "protect": 619,
    "psybeam": 620,
    "psyblade": 621,
    "psychic": 622,
    "psychicfangs": 623,
    "psychicnoise": 624,
    "psychicterrain": 625,
    "psychoboost": 626,
    "psychocut": 627,
    "psychoshift": 628,
    "psychup": 629,
    "psyshieldbash": 630,
    "psyshock": 631,
    "psystrike": 632,
    "psywave": 633,
    "pulverizingpancake": 634,
    "punishment": 635,
    "purify": 636,
    "pursuit": 637,
    "pyroball": 638,
    "quash": 639,
    "quickattack": 640,
    "quickguard": 641,
    "quiverdance": 642,
    "rage": 643,
    "ragefist": 644,
    "ragepowder": 645,
    "ragingbull": 646,
    "ragingfury": 647,
    "raindance": 648,
    "rapidspin": 649,
    "razorleaf": 650,
    "razorshell": 651,
    "razorwind": 652,
    "recover": 653,
    "recycle": 654,
    "reflect": 655,
    "reflecttype": 656,
    "refresh": 657,
    "relicsong": 658,
    "rest": 659,
    "retaliate": 660,
    "return": 661,
    "revelationdance": 662,
    "revenge": 663,
    "reversal": 664,
    "revivalblessing": 665,
    "risingvoltage": 666,
    "roar": 667,
    "roaroftime": 668,
    "rockblast": 669,
    "rockclimb": 670,
    "rockpolish": 671,
    "rockslide": 672,
    "rocksmash": 673,
    "rockthrow": 674,
    "rocktomb": 675,
    "rockwrecker": 676,
    "roleplay": 677,
    "rollingkick": 678,
    "rollout": 679,
    "roost": 680,
    "rototiller": 681,
    "round": 682,
    "ruination": 683,
    "sacredfire": 684,
    "sacredsword": 685,
    "safeguard": 686,
    "saltcure": 687,
    "sandattack": 688,
    "sandsearstorm": 689,
    "sandstorm": 690,
    "sandtomb": 691,
    "sappyseed": 692,
    "savagespinout": 693,
    "scald": 694,
    "scaleshot": 695,
    "scaryface": 696,
    "scorchingsands": 697,
    "scratch": 698,
    "screech": 699,
    "searingshot": 700,
    "searingsunrazesmash": 701,
    "secretpower": 702,
    "secretsword": 703,
    "seedbomb": 704,
    "seedflare": 705,
    "seismictoss": 706,
    "selfdestruct": 707,
    "shadowball": 708,
    "shadowbone": 709,
    "shadowclaw": 710,
    "shadowforce": 711,
    "shadowpunch": 712,
    "shadowsneak": 713,
    "shadowstrike": 714,
    "sharpen": 715,
    "shatteredpsyche": 716,
    "shedtail": 717,
    "sheercold": 718,
    "shellsidearm": 719,
    "shellsmash": 720,
    "shelltrap": 721,
    "shelter": 722,
    "shiftgear": 723,
    "shockwave": 724,
    "shoreup": 725,
    "signalbeam": 726,
    "silktrap": 727,
    "silverwind": 728,
    "simplebeam": 729,
    "sing": 730,
    "sinisterarrowraid": 731,
    "sizzlyslide": 732,
    "sketch": 733,
    "skillswap": 734,
    "skittersmack": 735,
    "skullbash": 736,
    "skyattack": 737,
    "skydrop": 738,
    "skyuppercut": 739,
    "slackoff": 740,
    "slam": 741,
    "slash": 742,
    "sleeppowder": 743,
    "sleeptalk": 744,
    "sludge": 745,
    "sludgebomb": 746,
    "sludgewave": 747,
    "smackdown": 748,
    "smartstrike": 749,
    "smellingsalts": 750,
    "smog": 751,
    "smokescreen": 752,
    "snaptrap": 753,
    "snarl": 754,
    "snatch": 755,
    "snipeshot": 756,
    "snore": 757,
    "snowscape": 758,
    "soak": 759,
    "softboiled": 760,
    "solarbeam": 761,
    "solarblade": 762,
    "sonicboom": 763,
    "soulstealing7starstrike": 764,
    "spacialrend": 765,
    "spark": 766,
    "sparklingaria": 767,
    "sparklyswirl": 768,
    "spectralthief": 769,
    "speedswap": 770,
    "spicyextract": 771,
    "spiderweb": 772,
    "spikecannon": 773,
    "spikes": 774,
    "spikyshield": 775,
    "spinout": 776,
    "spiritbreak": 777,
    "spiritshackle": 778,
    "spite": 779,
    "spitup": 780,
    "splash": 781,
    "splinteredstormshards": 782,
    "splishysplash": 783,
    "spore": 784,
    "spotlight": 785,
    "springtidestorm": 786,
    "stealthrock": 787,
    "steameruption": 788,
    "steamroller": 789,
    "steelbeam": 790,
    "steelroller": 791,
    "steelwing": 792,
    "stickyweb": 793,
    "stockpile": 794,
    "stokedsparksurfer": 795,
    "stomp": 796,
    "stompingtantrum": 797,
    "stoneaxe": 798,
    "stoneedge": 799,
    "storedpower": 800,
    "stormthrow": 801,
    "strangesteam": 802,
    "strength": 803,
    "strengthsap": 804,
    "stringshot": 805,
    "struggle": 806,
    "strugglebug": 807,
    "stuffcheeks": 808,
    "stunspore": 809,
    "submission": 810,
    "substitute": 811,
    "subzeroslammer": 812,
    "suckerpunch": 813,
    "sunnyday": 814,
    "sunsteelstrike": 815,
    "supercellslam": 816,
    "superfang": 817,
    "superpower": 818,
    "supersonic": 819,
    "supersonicskystrike": 820,
    "surf": 821,
    "surgingstrikes": 822,
    "swagger": 823,
    "swallow": 824,
    "sweetkiss": 825,
    "sweetscent": 826,
    "swift": 827,
    "switcheroo": 828,
    "swordsdance": 829,
    "synchronoise": 830,
    "synthesis": 831,
    "syrupbomb": 832,
    "tachyoncutter": 833,
    "tackle": 834,
    "tailglow": 835,
    "tailslap": 836,
    "tailwhip": 837,
    "tailwind": 838,
    "takedown": 839,
    "takeheart": 840,
    "tarshot": 841,
    "taunt": 842,
    "tearfullook": 843,
    "teatime": 844,
    "technoblast": 845,
    "tectonicrage": 846,
    "teeterdance": 847,
    "telekinesis": 848,
    "teleport": 849,
    "temperflare": 850,
    "terablast": 851,
    "terastarstorm": 852,
    "terrainpulse": 853,
    "thief": 854,
    "thousandarrows": 855,
    "thousandwaves": 856,
    "thrash": 857,
    "throatchop": 858,
    "thunder": 859,
    "thunderbolt": 860,
    "thundercage": 861,
    "thunderclap": 862,
    "thunderfang": 863,
    "thunderouskick": 864,
    "thunderpunch": 865,
    "thundershock": 866,
    "thunderwave": 867,
    "tickle": 868,
    "tidyup": 869,
    "topsyturvy": 870,
    "torchsong": 871,
    "torment": 872,
    "toxic": 873,
    "toxicspikes": 874,
    "toxicthread": 875,
    "trailblaze": 876,
    "transform": 877,
    "triattack": 878,
    "trick": 879,
    "trickortreat": 880,
    "trickroom": 881,
    "triplearrows": 882,
    "tripleaxel": 883,
    "tripledive": 884,
    "triplekick": 885,
    "tropkick": 886,
    "trumpcard": 887,
    "twinbeam": 888,
    "twineedle": 889,
    "twinkletackle": 890,
    "twister": 891,
    "upperhand": 892,
    "uproar": 893,
    "uturn": 894,
    "vacuumwave": 895,
    "vcreate": 896,
    "veeveevolley": 897,
    "venomdrench": 898,
    "venoshock": 899,
    "victorydance": 900,
    "vinewhip": 901,
    "visegrip": 902,
    "vitalthrow": 903,
    "voltswitch": 904,
    "volttackle": 905,
    "wakeupslap": 906,
    "waterfall": 907,
    "watergun": 908,
    "waterpledge": 909,
    "waterpulse": 910,
    "watershuriken": 911,
    "watersport": 912,
    "waterspout": 913,
    "wavecrash": 914,
    "weatherball": 915,
    "whirlpool": 916,
    "whirlwind": 917,
    "wickedblow": 918,
    "wickedtorque": 919,
    "wideguard": 920,
    "wildboltstorm": 921,
    "wildcharge": 922,
    "willowisp": 923,
    "wingattack": 924,
    "wish": 925,
    "withdraw": 926,
    "wonderroom": 927,
    "woodhammer": 928,
    "workup": 929,
    "worryseed": 930,
    "wrap": 931,
    "wringout": 932,
    "xscissor": 933,
    "yawn": 934,
    "zapcannon": 935,
    "zenheadbutt": 936,
    "zingzap": 937,
    "zippyzap": 938
  },
  "side_conditions": {
    "auroraveil": 1,
    "craftyshield": 2,
    "firepledge": 3,
    "gmaxcannonade": 4,
    "gmaxsteelsurge": 5,
    "gmaxvinelash": 6,
    "gmaxvolcalith": 7,
    "gmaxwildfire": 8,
    "grasspledge": 9,
    "lightscreen": 10,
    "luckychant": 11,
    "matblock": 12,
    "mist": 13,
    "quickguard": 14,
    "reflect": 15,
    "safeguard": 16,
    "spikes": 17,
    "stealthrock": 18,
    "stickyweb": 19,
    "tailwind": 20,
    "toxicspikes": 21,
    "unknown": 22,
    "waterpledge": 23,
    "wideguard": 24
  },
  "species": {
    "ababo": 1,
    "abomasnow": 2,
    "abomasnowmega": 3,
    "abra": 4,
    "absol": 5,
    "absolmega": 6,
    "absolmegaz": 7,
    "accelgor": 8,
    "aegislash": 9,
    "aegislashblade": 10,
    "aerodactyl": 11,
    "aerodactylmega": 12,
    "aggron": 13,
    "aggronmega": 14,
    "aipom": 15,
    "alakazam": 16,
    "alakazammega": 17,
    "alcremie": 18,
    "alcremiecaramelswirl": 19,
    "alcremiegmax": 20,
    "alcremielemoncream": 21,
    "alcremiematchacream": 22,
    "alcremiemintcream": 23,
    "alcremierainbowswirl": 24,
    "alcremierubycream": 25,
    "alcremierubyswirl": 26,
    "alomomola": 27,
    "altaria": 28,
    "altariamega": 29,
    "amaura": 30,
    "ambipom": 31,
    "amoonguss": 32,
    "ampharos": 33,
    "ampharosmega": 34,
    "annihilape": 35,
    "anorith": 36,
    "appletun": 37,
    "appletungmax": 38,
    "applin": 39,
    "araquanid": 40,
    "araquanidtotem": 41,
    "arbok": 42,
    "arboliva": 43,
    "arcanine": 44,
    "arcaninehisui": 45,
    "arceus": 46,
    "arceusbug": 47,
    "arceusdark": 48,
    "arceusdragon": 49,
    "arceuselectric": 50,
    "arceusfairy": 51,
    "arceusfighting": 52,
    "arceusfire": 53,
    "arceusflying": 54,
    "arceusghost": 55,
    "arceusgrass": 56,
    "arceusground": 57,
    "arceusice": 58,
    "arceuspoison": 59,
    "arceuspsychic": 60,
    "arceusrock": 61,
    "arceussteel": 62,
    "arceuswater": 63,
    "archaludon": 64,
    "archen": 65,
    "archeops": 66,
    "arctibax": 67,
    "arctovish": 68,
    "arctozolt": 69,
    "argalis": 70,
    "arghonaut": 71,
    "ariados": 72,
    "armaldo": 73,
    "armarouge": 74,
    "aromatisse": 75,
    "aron": 76,
    "arrokuda": 77,
    "articuno": 78,
    "articunogalar": 79,
    "astrolotl": 80,
    "audino": 81,
    "audinomega": 82,
    "aurorus": 83,
    "aurumoth": 84,
    "avalugg": 85,
    "avalugghisui": 86,
    "axew": 87,
    "azelf": 88,
    "azumarill": 89,
    "azurill": 90,
    "bagon": 91,
    "baltoy": 92,
    "banette": 93,
    "banettemega": 94,
    "barbaracle": 95,
    "barbaraclemega": 96,
    "barboach": 97,
    "barraskewda": 98,
    "basculegion": 99,
    "basculegionf": 100,
    "basculin": 101,
    "basculinbluestriped": 102,
    "basculinwhitestriped": 103,
    "bastiodon": 104,
    "baxcalibur": 105,
    "baxcaliburmega": 106,
    "bayleef": 107,
    "beartic": 108,
    "beautifly": 109,
    "beedrill": 110,
    "beedrillmega": 111,
    "beheeyem": 112,
    "beldum": 113,
    "bellibolt": 114,
    "bellossom": 115,
    "bellsprout": 116,
    "bergmite": 117,
    "bewear": 118,
    "bibarel": 119,
    "bidoof": 120,
    "binacle": 121,
    "bisharp": 122,
    "blacephalon": 123,
    "blastoise": 124,
    "blastoisegmax": 125,
    "blastoisemega": 126,
    "blaziken": 127,
    "blazikenmega": 128,
    "blipbug": 129,
    "blissey": 130,
    "blitzle": 131,
    "boldore": 132,
    "boltund": 133,
    "bombirdier": 134,
    "bonsly": 135,
    "bouffalant": 136,
    "bounsweet": 137,
    "braixen": 138,
    "brambleghast": 139,
    "bramblin": 140,
    "brattler": 141,
    "braviary": 142,
    "braviaryhisui": 143,
    "breezi": 144,
    "breloom": 145,
    "brionne": 146,
    "bronzong": 147,
    "bronzor": 148,
    "brutebonnet": 149,
    "bruxish": 150,
    "budew": 151,
    "buizel": 152,
    "bulbasaur": 153,
    "buneary": 154,
    "bunnelby": 155,
    "burmy": 156,
    "burmysandy": 157,
    "burmytrash": 158,
    "butterfree": 159,
    "butterfreegmax": 160,
    "buzzwole": 161,
    "cacnea": 162,
    "cacturne": 163,
    "caimanoe": 164,
    "calyrex": 165,
    "calyrexice": 166,
    "calyrexshadow": 167,
    "camerupt": 168,
    "cameruptmega": 169,
    "capsakid": 170,
    "carbink": 171,
    "caribolt": 172,
    "carkol": 173,
    "carnivine": 174,
    "carracosta": 175,
    "carvanha": 176,
    "cascoon": 177,
    "castform": 178,
    "castformrainy": 179,
    "castformsnowy": 180,
    "castformsunny": 181,
    "caterpie": 182,
    "cawdet": 183,
    "cawmodore": 184,
    "celebi": 185,
    "celesteela": 186,
    "centiskorch": 187,
    "centiskorchgmax": 188,
    "ceruledge": 189,
    "cetitan": 190,
    "cetoddle": 191,
    "chandelure": 192,
    "chandeluremega": 193,
    "chansey": 194,
    "charcadet": 195,
    "charizard": 196,
    "charizardgmax": 197,
    "charizardmegax": 198,
    "charizardmegay": 199,
    "charjabug": 200,
    "charmander": 201,
    "charmeleon": 202,
    "chatot": 203,
    "cherrim": 204,
    "cherrimsunshine": 205,
    "cherubi": 206,
    "chesnaught": 207,
    "chesnaughtmega": 208,
    "chespin": 209,
    "chewtle": 210,
    "chienpao": 211,
    "chikorita": 212,
    "chimchar": 213,
    "chimecho": 214,
    "chimechomega": 215,
    "chinchou": 216,
    "chingling": 217,
    "chiyu": 218,
    "chromera": 219,
    "chuggalong": 220,
    "chuggon": 221,
    "cinccino": 222,
    "cinderace": 223,
    "cinderacegmax": 224,
    "clamperl": 225,
    "clauncher": 226,
    "clawitzer": 227,
    "claydol": 228,
    "clefable": 229,
    "clefablemega": 230,
    "clefairy": 231,
    "cleffa": 232,
    "clobbopus": 233,
    "clodsire": 234,
    "cloyster": 235,
    "coalossal": 236,
    "coalossalgmax": 237,
    "cobalion": 238,
    "cofagrigus": 239,
    "colossoil": 240,
    "combee": 241,
    "combusken": 242,
    "comfey": 243,
    "conkeldurr": 244,
    "copperajah": 245,
    "copperajahgmax": 246,
    "coribalis": 247,
    "corphish": 248,
    "corsola": 249,
    "corsolagalar": 250,
    "corviknight": 251,
    "corviknightgmax": 252,
    "corvisquire": 253,
    "cosmoem": 254,
    "cosmog": 255,
    "cottonee": 256,
    "crabominable": 257,
    "crabominablemega": 258,
    "crabrawler": 259,
    "cradily": 260,
    "cramorant": 261,
    "cramorantgorging": 262,
    "cramorantgulping": 263,
    "cranidos": 264,
    "crawdaunt": 265,
    "cresceidon": 266,
    "cresselia": 267,
    "croagunk": 268,
    "crobat": 269,
    "crocalor": 270,
    "croconaw": 271,
    "crucibelle": 272,
    "crucibellemega": 273,
    "crustle": 274,
    "cryogonal": 275,
    "cubchoo": 276,
    "cubone": 277,
    "cufant": 278,
    "cupra": 279,
    "cursola": 280,
    "cutiefly": 281,
    "cyclizar": 282,
    "cyclohm": 283,
    "cyndaquil": 284,
    "dachsbun": 285,
    "darkrai": 286,
    "darkraimega": 287,
    "darmanitan": 288,
    "darmanitangalar": 289,
    "darmanitangalarzen": 290,
    "darmanitanzen": 291,
    "dartrix": 292,
    "darumaka": 293,
    "darumakagalar": 294,
    "decidueye": 295,
    "decidueyehisui": 296,
    "dedenne": 297,
    "deerling": 298,
    "deerlingautumn": 299,
    "deerlingsummer": 300,
    "deerlingwinter": 301,
    "deino": 302,
    "delcatty": 303,
    "delibird": 304,
    "delphox": 305,
    "delphoxmega": 306,
    "deoxys": 307,
    "deoxysattack": 308,
    "deoxysdefense": 309,
    "deoxysspeed": 310,
    "dewgong": 311,
    "dewott": 312,
    "dewpider": 313,
    "dhelmise": 314,
    "dialga": 315,
    "dialgaorigin": 316,
    "diancie": 317,
    "dianciemega": 318,
    "diggersby": 319,
    "diglett": 320,
    "diglettalola": 321,
    "dipplin": 322,
    "ditto": 323,
    "dodrio": 324,
    "doduo": 325,
    "dolliv": 326,
    "dondozo": 327,
    "donphan": 328,
    "dorsoil": 329,
    "dottler": 330,
    "doublade": 331,
    "dracovish": 332,
    "dracozolt": 333,
    "dragalge": 334,
    "dragalgemega": 335,
    "dragapult": 336,
    "draggalong": 337,
    "dragonair": 338,
    "dragonite": 339,
    "dragonitemega": 340,
    "drakloak": 341,
    "drampa": 342,
    "drampamega": 343,
    "drapion": 344,
    "dratini": 345,
    "drednaw": 346,
    "drednawgmax": 347,
    "dreepy": 348,
    "drifblim": 349,
    "drifloon": 350,
    "drilbur": 351,
    "drizzile": 352,
    "drowzee": 353,
    "druddigon": 354,
    "dubwool": 355,
    "ducklett": 356,
    "dudunsparce": 357,
    "dudunsparcethreesegment": 358,
    "dugtrio": 359,
    "dugtrioalola": 360,
    "dunsparce": 361,
    "duohm": 362,
    "duosion": 363,
    "duraludon": 364,
    "duraludongmax": 365,
    "durant": 366,
    "dusclops": 367,
    "dusknoir": 368,
    "duskull": 369,
    "dustox": 370,
    "dwebble": 371,
    "eelektrik": 372,
    "eelektross": 373,
