{
  "abilities": {
    "adaptability": 1,
    "aerilate": 2,
    "aftermath": 3,
    "analytic": 4,
    "angerpoint": 5,
    "anticipation": 6,
    "armortail": 7,
    "aromaveil": 8,
    "battlearmor": 9,
    "battlebond": 10,
    "berserk": 11,
    "bigpecks": 12,
    "blaze": 13,
    "bulletproof": 14,
    "cheekpouch": 15,
    "chlorophyll": 16,
    "clearbody": 17,
    "cloudnine": 18,
    "competitive": 19,
    "compoundeyes": 20,
    "contrary": 21,
    "corrosion": 22,
    "cudchew": 23,
    "curiousmedicine": 24,
    "cursedbody": 25,
    "cutecharm": 26,
    "damp": 27,
    "defiant": 28,
    "disguise": 29,
    "dragonize": 30,
    "drizzle": 31,
    "drought": 32,
    "dryskin": 33,
    "earlybird": 34,
    "eartheater": 35,
    "eelevate": 36,
    "effectspore": 37,
    "electricsurge": 38,
    "electromorphosis": 39,
    "embodyaspectcornerstone": 40,
    "embodyaspecthearthflame": 41,
    "embodyaspectteal": 42,
    "embodyaspectwellspring": 43,
    "fairyaura": 44,
    "filter": 45,
    "firemane": 46,
    "flamebody": 47,
    "flashfire": 48,
    "flowerveil": 49,
    "fluffy": 50,
    "forecast": 51,
    "forewarn": 52,
    "friendguard": 53,
    "frisk": 54,
    "furcoat": 55,
    "galewings": 56,
    "gluttony": 57,
    "goodasgold": 58,
    "gooey": 59,
    "gulpmissile": 60,
    "guts": 61,
    "harvest": 62,
    "healer": 63,
    "heatproof": 64,
    "heavymetal": 65,
    "hospitality": 66,
    "hugepower": 67,
    "hungerswitch": 68,
    "hustle": 69,
    "hydration": 70,
    "hypercutter": 71,
    "icebody": 72,
    "iceface": 73,
    "illuminate": 74,
    "illusion": 75,
    "immunity": 76,
    "imposter": 77,
    "infiltrator": 78,
    "innardsout": 79,
    "innerfocus": 80,
    "insomnia": 81,
    "intimidate": 82,
    "ironfist": 83,
    "justified": 84,
    "keeneye": 85,
    "klutz": 86,
    "leafguard": 87,
    "levitate": 88,
    "lightmetal": 89,
    "lightningrod": 90,
    "limber": 91,
    "liquidvoice": 92,
    "longreach": 93,
    "magicbounce": 94,
    "magicguard": 95,
    "magician": 96,
    "magmaarmor": 97,
    "marvelscale": 98,
    "megalauncher": 99,
    "megasol": 100,
    "merciless": 101,
    "mimicry": 102,
    "minus": 103,
    "mirrorarmor": 104,
    "moldbreaker": 105,
    "moody": 106,
    "motordrive": 107,
    "moxie": 108,
    "multiscale": 109,
    "mummy": 110,
    "naturalcure": 111,
    "noguard": 112,
    "oblivious": 113,
    "opportunist": 114,
    "overcoat": 115,
    "overgrow": 116,
    "owntempo": 117,
    "parentalbond": 118,
    "pickpocket": 119,
    "pickup": 120,
    "piercingdrill": 121,
    "pixilate": 122,
    "plus": 123,
    "poisonheal": 124,
    "poisonpoint": 125,
    "poisontouch": 126,
    "prankster": 127,
    "pressure": 128,
    "protean": 129,
    "purepower": 130,
    "purifyingsalt": 131,
    "queenlymajesty": 132,
    "quickdraw": 133,
    "quickfeet": 134,
    "raindish": 135,
    "receiver": 136,
    "reckless": 137,
    "refrigerate": 138,
    "regenerator": 139,
    "ripen": 140,
    "rivalry": 141,
    "rockhead": 142,
    "roughskin": 143,
    "sandforce": 144,
    "sandrush": 145,
    "sandspit": 146,
    "sandstream": 147,
    "sandveil": 148,
    "sapsipper": 149,
    "scrappy": 150,
    "screencleaner": 151,
    "shadowtag": 152,
    "sharpness": 153,
    "shedskin": 154,
    "sheerforce": 155,
    "shellarmor": 156,
    "shielddust": 157,
    "shieldsdown": 158,
    "skilllink": 159,
    "slushrush": 160,
    "sniper": 161,
    "snowcloak": 162,
    "snowwarning": 163,
    "solarpower": 164,
    "solidrock": 165,
    "soundproof": 166,
    "speedboost": 167,
    "spicyspray": 168,
    "stall": 169,
    "stalwart": 170,
    "stamina": 171,
    "stancechange": 172,
    "static": 173,
    "steadfast": 174,
    "stench": 175,
    "stickyhold": 176,
    "strongjaw": 177,
    "sturdy": 178,
    "suctioncups": 179,
    "superluck": 180,
    "supersweetsyrup": 181,
    "supremeoverlord": 182,
    "surgesurfer": 183,
    "swarm": 184,
    "sweetveil": 185,
    "swiftswim": 186,
    "symbiosis": 187,
    "synchronize": 188,
    "tangledfeet": 189,
    "technician": 190,
    "telepathy": 191,
    "thickfat": 192,
    "torrent": 193,
    "toughclaws": 194,
    "toxicdebris": 195,
    "trace": 196,
    "unaware": 197,
    "unburden": 198,
    "unnerve": 199,
    "unseenfist": 200,
    "vitalspirit": 201,
    "voltabsorb": 202,
    "wanderingspirit": 203,
    "waterabsorb": 204,
    "waterbubble": 205,
    "weakarmor": 206,
    "whitesmoke": 207,
    "zerotohero": 208
  },
  "categories": {
    "physical": 1,
    "special": 2,
    "status": 3
  },
  "fields": {
    "electricterrain": 1,
    "fairylock": 2,
    "grassyterrain": 3,
    "gravity": 4,
    "healblock": 5,
    "magicroom": 6,
    "mistyterrain": 7,
    "mudsport": 8,
    "mudspot": 9,
    "neutralizinggas": 10,
    "psychicterrain": 11,
    "trickroom": 12,
    "watersport": 13,
    "wonderroom": 14
  },
  "items": {
    "abomasite": 1,
    "absolite": 2,
    "aerodactylite": 3,
    "aggronite": 4,
    "alakazite": 5,
    "altarianite": 6,
    "ampharosite": 7,
    "aspearberry": 8,
    "audinite": 9,
    "babiriberry": 10,
    "banettite": 11,
    "barbaracite": 12,
    "beedrillite": 13,
    "bigroot": 14,
    "blackbelt": 15,
    "blackglasses": 16,
    "blastoisinite": 17,
    "blazikenite": 18,
    "brightpowder": 19,
    "cameruptite": 20,
    "chandelurite": 21,
    "charcoal": 22,
    "charizarditex": 23,
    "charizarditey": 24,
    "chartiberry": 25,
    "cheriberry": 26,
    "chesnaughtite": 27,
    "chestoberry": 28,
    "chilanberry": 29,
    "chimechite": 30,
    "choicescarf": 31,
    "chopleberry": 32,
    "clefablite": 33,
    "cobaberry": 34,
    "colburberry": 35,
    "crabominite": 36,
    "damprock": 37,
    "delphoxite": 38,
    "dragalgite": 39,
    "dragonfang": 40,
    "dragoninite": 41,
    "drampanite": 42,
    "eelektrossite": 43,
    "emboarite": 44,
    "excadrite": 45,
    "expertbelt": 46,
    "fairyfeather": 47,
    "falinksite": 48,
    "feraligite": 49,
    "floettite": 50,
    "focusband": 51,
    "focussash": 52,
    "froslassite": 53,
    "galladite": 54,
    "garchompite": 55,
    "gardevoirite": 56,
    "gengarite": 57,
    "glalitite": 58,
    "glimmoranite": 59,
    "golurkite": 60,
    "greninjite": 61,
    "gyaradosite": 62,
    "habanberry": 63,
    "hardstone": 64,
    "hawluchanite": 65,
    "heatrock": 66,
    "heracronite": 67,
    "houndoominite": 68,
    "icyrock": 69,
    "ironball": 70,
    "kangaskhanite": 71,
    "kasibberry": 72,
    "kebiaberry": 73,
    "kingsrock": 74,
    "leftovers": 75,
    "leppaberry": 76,
    "lifeorb": 77,
    "lightball": 78,
    "lightclay": 79,
    "lopunnite": 80,
    "lucarionite": 81,
    "lumberry": 82,
    "magnet": 83,
    "malamarite": 84,
    "manectite": 85,
    "mawilite": 86,
    "medichamite": 87,
    "meganiumite": 88,
    "mentalherb": 89,
    "meowsticite": 90,
    "metagrossite": 91,
    "metalcoat": 92,
    "metronome": 93,
    "miracleseed": 94,
    "muscleband": 95,
    "mysticwater": 96,
    "nevermeltice": 97,
    "occaberry": 98,
    "oranberry": 99,
    "passhoberry": 100,
    "payapaberry": 101,
    "pechaberry": 102,
    "persimberry": 103,
    "pidgeotite": 104,
    "pinsirite": 105,
    "poisonbarb": 106,
    "pyroarite": 107,
    "quickclaw": 108,
    "raichunitex": 109,
    "raichunitey": 110,
    "rawstberry": 111,
    "rindoberry": 112,
    "roseliberry": 113,
    "sablenite": 114,
    "sceptilite": 115,
    "scizorite": 116,
    "scolipite": 117,
    "scopelens": 118,
    "scovillainite": 119,
    "scraftinite": 120,
    "sharpbeak": 121,
    "sharpedonite": 122,
    "shedshell": 123,
    "shellbell": 124,
    "shucaberry": 125,
    "silkscarf": 126,
    "silverpowder": 127,
    "sitrusberry": 128,
    "skarmorite": 129,
    "slowbronite": 130,
    "smoothrock": 131,
    "softsand": 132,
    "spelltag": 133,
    "staraptite": 134,
    "starminite": 135,
    "steelixite": 136,
    "swampertite": 137,
    "tangaberry": 138,
    "twistedspoon": 139,
    "tyranitarite": 140,
    "venusaurite": 141,
    "victreebelite": 142,
    "wacanberry": 143,
    "whiteherb": 144,
    "widelens": 145,
    "wiseglasses": 146,
    "yacheberry": 147,
    "zoomlens": 148
  },
  "moves": {
    "accelerock": 1,
    "acidarmor": 2,
    "acidspray": 3,
    "acrobatics": 4,
    "acupressure": 5,
    "aerialace": 6,
    "afteryou": 7,
    "agility": 8,
    "aircutter": 9,
    "airslash": 10,
    "alluringvoice": 11,
    "allyswitch": 12,
    "amnesia": 13,
    "ancientpower": 14,
    "appleacid": 15,
    "aquacutter": 16,
    "aquajet": 17,
    "aquaring": 18,
    "aquastep": 19,
    "aquatail": 20,
    "armorcannon": 21,
    "aromaticmist": 22,
    "assurance": 23,
    "attract": 24,
    "aurasphere": 25,
    "aurawheel": 26,
    "auroraveil": 27,
    "avalanche": 28,
    "axekick": 29,
    "babydolleyes": 30,
    "banefulbunker": 31,
    "barbbarrage": 32,
    "batonpass": 33,
    "beakblast": 34,
    "beatup": 35,
    "belch": 36,
    "bellydrum": 37,
    "bind": 38,
    "bite": 39,
    "bitterblade": 40,
    "bittermalice": 41,
    "blastburn": 42,
    "blazekick": 43,
    "blizzard": 44,
    "block": 45,
    "bodypress": 46,
    "bodyslam": 47,
    "bonerush": 48,
    "boomburst": 49,
    "bounce": 50,
    "bravebird": 51,
    "breakingswipe": 52,
    "brickbreak": 53,
    "brutalswing": 54,
    "bugbite": 55,
    "bugbuzz": 56,
    "bulkup": 57,
    "bulldoze": 58,
    "bulletpunch": 59,
    "bulletseed": 60,
    "burningjealousy": 61,
    "burnup": 62,
    "calmmind": 63,
    "ceaselessedge": 64,
    "charge": 65,
    "chargebeam": 66,
    "charm": 67,
    "chillingwater": 68,
    "chillyreception": 69,
    "circlethrow": 70,
    "clangingscales": 71,
    "clangoroussoul": 72,
    "clearsmog": 73,
    "closecombat": 74,
    "coaching": 75,
    "coil": 76,
    "comeuppance": 77,
    "confuseray": 78,
    "copycat": 79,
    "corrosivegas": 80,
    "cosmicpower": 81,
    "cottonguard": 82,
    "cottonspore": 83,
    "counter": 84,
    "covet": 85,
    "crabhammer": 86,
    "crosschop": 87,
    "crosspoison": 88,
    "crunch": 89,
    "crushclaw": 90,
    "curse": 91,
    "darkestlariat": 92,
    "darkpulse": 93,
    "dazzlinggleam": 94,
    "decorate": 95,
    "defog": 96,
    "destinybond": 97,
    "detect": 98,
    "dig": 99,
    "direclaw": 100,
    "disable": 101,
    "discharge": 102,
    "dive": 103,
    "doubleedge": 104,
    "doublehit": 105,
    "doubleteam": 106,
    "dracometeor": 107,
    "dragoncheer": 108,
    "dragonclaw": 109,
    "dragondance": 110,
    "dragondarts": 111,
    "dragonpulse": 112,
    "dragonrush": 113,
    "dragontail": 114,
    "drainingkiss": 115,
    "drainpunch": 116,
    "drillpeck": 117,
    "drillrun": 118,
    "dualwingbeat": 119,
    "dynamicpunch": 120,
    "earthpower": 121,
    "earthquake": 122,
    "eerieimpulse": 123,
    "eeriespell": 124,
    "electricterrain": 125,
    "electrify": 126,
    "electroball": 127,
    "electroshot": 128,
    "electroweb": 129,
    "encore": 130,
    "endeavor": 131,
    "endure": 132,
    "energyball": 133,
    "entrainment": 134,
    "eruption": 135,
    "expandingforce": 136,
    "explosion": 137,
    "extrasensory": 138,
    "extremespeed": 139,
    "facade": 140,
    "fairylock": 141,
    "fakeout": 142,
    "faketears": 143,
    "featherdance": 144,
    "feint": 145,
    "fellstinger": 146,
    "ficklebeam": 147,
    "fierydance": 148,
    "finalgambit": 149,
    "fireblast": 150,
    "firefang": 151,
    "firelash": 152,
    "firepunch": 153,
    "firespin": 154,
    "firstimpression": 155,
    "fissure": 156,
    "flail": 157,
    "flamecharge": 158,
    "flamethrower": 159,
    "flareblitz": 160,
    "flashcannon": 161,
    "flatter": 162,
    "fling": 163,
    "flipturn": 164,
    "flowertrick": 165,
    "fly": 166,
    "flyingpress": 167,
    "focusblast": 168,
    "focusenergy": 169,
    "focuspunch": 170,
    "followme": 171,
    "forestscurse": 172,
    "foulplay": 173,
    "freezedry": 174,
    "frenzyplant": 175,
    "frostbreath": 176,
    "futuresight": 177,
    "gastroacid": 178,
    "gigadrain": 179,
    "gigaimpact": 180,
    "gigatonhammer": 181,
    "glare": 182,
    "grassknot": 183,
    "grassyglide": 184,
    "grassyterrain": 185,
    "gravapple": 186,
    "gravity": 187,
    "growth": 188,
    "guardsplit": 189,
    "guardswap": 190,
    "guillotine": 191,
    "gunkshot": 192,
    "gyroball": 193,
    "hammerarm": 194,
    "hardpress": 195,
    "haze": 196,
    "headlongrush": 197,
    "headsmash": 198,
    "healbell": 199,
    "healingwish": 200,
    "healpulse": 201,
    "heatcrash": 202,
    "heatwave": 203,
    "heavyslam": 204,
    "helpinghand": 205,
    "hex": 206,
    "highhorsepower": 207,
    "highjumpkick": 208,
    "horndrill": 209,
    "hornleech": 210,
    "howl": 211,
    "hurricane": 212,
    "hydrocannon": 213,
    "hydropump": 214,
    "hyperbeam": 215,
    "hypervoice": 216,
    "hypnosis": 217,
    "icebeam": 218,
    "icefang": 219,
    "icehammer": 220,
    "icepunch": 221,
    "iceshard": 222,
    "icespinner": 223,
    "iciclecrash": 224,
    "iciclespear": 225,
    "icywind": 226,
    "imprison": 227,
    "infernalparade": 228,
    "inferno": 229,
    "infestation": 230,
    "ingrain": 231,
    "instruct": 232,
    "irondefense": 233,
    "ironhead": 234,
    "irontail": 235,
    "jetpunch": 236,
    "kingsshield": 237,
    "knockoff": 238,
    "kowtowcleave": 239,
    "lashout": 240,
    "lastresort": 241,
    "lastrespects": 242,
    "lavaplume": 243,
    "leafblade": 244,
    "leafstorm": 245,
    "leechlife": 246,
    "leechseed": 247,
    "lifedew": 248,
    "lightofruin": 249,
    "lightscreen": 250,
    "liquidation": 251,
    "lockon": 252,
    "lowkick": 253,
    "lowsweep": 254,
    "luminacrash": 255,
    "lunge": 256,
    "machpunch": 257,
    "magicpowder": 258,
    "magicroom": 259,
    "magneticflux": 260,
    "magnetrise": 261,
    "makeitrain": 262,
    "matchagotcha": 263,
    "meanlook": 264,
    "megahorn": 265,
    "megakick": 266,
    "memento": 267,
    "metalburst": 268,
    "metalsound": 269,
    "meteorbeam": 270,
    "meteormash": 271,
    "minimize": 272,
    "mirrorcoat": 273,
    "mistyexplosion": 274,
    "mistyterrain": 275,
    "moonblast": 276,
    "moonlight": 277,
    "morningsun": 278,
    "mortalspin": 279,
    "mountaingale": 280,
    "muddywater": 281,
    "mudshot": 282,
    "mudslap": 283,
    "mysticalfire": 284,
    "nastyplot": 285,
    "nightdaze": 286,
    "nightshade": 287,
    "nightslash": 288,
    "nobleroar": 289,
    "noretreat": 290,
    "nuzzle": 291,
    "outrage": 292,
    "overheat": 293,
    "painsplit": 294,
    "paraboliccharge": 295,
    "partingshot": 296,
    "payback": 297,
    "perishsong": 298,
    "petalblizzard": 299,
    "petaldance": 300,
    "phantomforce": 301,
    "pinmissile": 302,
    "playrough": 303,
    "pluck": 304,
    "poisonfang": 305,
    "poisonjab": 306,
    "poisonpowder": 307,
    "pollenpuff": 308,
    "poltergeist": 309,
    "populationbomb": 310,
    "pounce": 311,
    "pound": 312,
    "powergem": 313,
    "powersplit": 314,
    "powerswap": 315,
    "powertrick": 316,
    "powertrip": 317,
    "powerwhip": 318,
    "protect": 319,
    "psychic": 320,
    "psychicfangs": 321,
    "psychicnoise": 322,
    "psychicterrain": 323,
    "psychocut": 324,
    "psychup": 325,
    "psyshieldbash": 326,
    "psyshock": 327,
    "quash": 328,
    "quickattack": 329,
    "quickguard": 330,
    "quiverdance": 331,
    "ragefist": 332,
    "ragepowder": 333,
    "ragingbull": 334,
    "ragingfury": 335,
    "raindance": 336,
    "rapidspin": 337,
    "razorshell": 338,
    "recover": 339,
    "recycle": 340,
    "reflect": 341,
    "reflecttype": 342,
    "rest": 343,
    "reversal": 344,
    "risingvoltage": 345,
    "roar": 346,
    "rockblast": 347,
    "rockpolish": 348,
    "rockslide": 349,
    "rocktomb": 350,
    "rockwrecker": 351,
    "roleplay": 352,
    "roost": 353,
    "round": 354,
    "sacredsword": 355,
    "safeguard": 356,
    "saltcure": 357,
    "sandstorm": 358,
    "sandtomb": 359,
    "scald": 360,
    "scaleshot": 361,
    "scaryface": 362,
    "scorchingsands": 363,
    "screech": 364,
    "seedbomb": 365,
    "seismictoss": 366,
    "selfdestruct": 367,
    "shadowball": 368,
    "shadowclaw": 369,
    "shadowpunch": 370,
    "shadowsneak": 371,
    "shedtail": 372,
    "sheercold": 373,
    "shellsidearm": 374,
    "shellsmash": 375,
    "shelter": 376,
    "simplebeam": 377,
    "sing": 378,
    "skillswap": 379,
    "skittersmack": 380,
    "skyattack": 381,
    "slackoff": 382,
    "sleeppowder": 383,
    "sleeptalk": 384,
    "sludgebomb": 385,
    "sludgewave": 386,
    "smackdown": 387,
    "smartstrike": 388,
    "snaptrap": 389,
    "snarl": 390,
    "snore": 391,
    "snowscape": 392,
    "soak": 393,
    "solarbeam": 394,
    "solarblade": 395,
    "sparklingaria": 396,
    "speedswap": 397,
    "spicyextract": 398,
    "spikes": 399,
    "spikyshield": 400,
    "spiritbreak": 401,
    "spiritshackle": 402,
    "spite": 403,
    "spitup": 404,
    "stealthrock": 405,
    "steelbeam": 406,
    "steelroller": 407,
    "steelwing": 408,
    "stickyweb": 409,
    "stockpile": 410,
    "stompingtantrum": 411,
    "stoneaxe": 412,
    "stoneedge": 413,
    "storedpower": 414,
    "stormthrow": 415,
    "strengthsap": 416,
    "stringshot": 417,
    "struggle": 418,
    "strugglebug": 419,
    "stuffcheeks": 420,
    "stunspore": 421,
    "substitute": 422,
    "suckerpunch": 423,
    "sunnyday": 424,
    "supercellslam": 425,
    "superfang": 426,
    "superpower": 427,
    "surf": 428,
    "swagger": 429,
    "swallow": 430,
    "sweetkiss": 431,
    "sweetscent": 432,
    "switcheroo": 433,
    "swordsdance": 434,
    "synthesis": 435,
    "syrupbomb": 436,
    "tailslap": 437,
    "tailwind": 438,
    "taunt": 439,
    "tearfullook": 440,
    "teatime": 441,
    "teeterdance": 442,
    "temperflare": 443,
    "terrainpulse": 444,
    "thief": 445,
    "thrash": 446,
    "throatchop": 447,
    "thunder": 448,
    "thunderbolt": 449,
    "thunderfang": 450,
    "thunderpunch": 451,
    "thunderwave": 452,
    "tickle": 453,
    "tidyup": 454,
    "topsyturvy": 455,
    "torchsong": 456,
    "torment": 457,
    "toxic": 458,
    "toxicspikes": 459,
    "toxicthread": 460,
    "trailblaze": 461,
    "transform": 462,
    "triattack": 463,
    "trick": 464,
    "trickortreat": 465,
    "trickroom": 466,
    "triplearrows": 467,
    "tripleaxel": 468,
    "tropkick": 469,
    "twinbeam": 470,
    "upperhand": 471,
    "uproar": 472,
    "uturn": 473,
    "vacuumwave": 474,
    "venoshock": 475,
    "voltswitch": 476,
    "volttackle": 477,
    "waterfall": 478,
    "waterpulse": 479,
    "watershuriken": 480,
    "waterspout": 481,
    "wavecrash": 482,
    "weatherball": 483,
    "whirlpool": 484,
    "whirlwind": 485,
    "wideguard": 486,
    "wildcharge": 487,
    "willowisp": 488,
    "wish": 489,
    "wonderroom": 490,
    "woodhammer": 491,
    "worryseed": 492,
    "wrap": 493,
    "xscissor": 494,
    "yawn": 495,
    "zapcannon": 496,
    "zenheadbutt": 497
  },
  "side_conditions": {
    "auroraveil": 1,
    "craftyshield": 2,
    "firepledge": 3,
    "gmaxcannonade": 4,
    "gmaxsteelsurge": 5,
    "gmaxvinelash": 6,
    "gmaxvolcalith": 7,
    "gmaxwildfire": 8,
    "grasspledge": 9,
    "lightscreen": 10,
    "luckychant": 11,
    "matblock": 12,
    "mist": 13,
    "quickguard": 14,
    "reflect": 15,
    "safeguard": 16,
    "spikes": 17,
    "stealthrock": 18,
    "stickyweb": 19,
    "tailwind": 20,
    "toxicspikes": 21,
    "waterpledge": 22,
    "wideguard": 23
  },
  "species": {
    "abomasnow": 1,
    "abomasnowmega": 2,
    "absol": 3,
    "absolmega": 4,
    "aegislash": 5,
    "aegislashblade": 6,
    "aerodactyl": 7,
    "aerodactylmega": 8,
    "aggron": 9,
    "aggronmega": 10,
    "alakazam": 11,
    "alakazammega": 12,
    "alcremie": 13,
    "alcremiecaramelswirl": 14,
    "alcremielemoncream": 15,
    "alcremiematchacream": 16,
    "alcremiemintcream": 17,
    "alcremierainbowswirl": 18,
    "alcremierubycream": 19,
    "alcremierubyswirl": 20,
    "altaria": 21,
    "altariamega": 22,
    "ampharos": 23,
    "ampharosmega": 24,
    "annihilape": 25,
    "appletun": 26,
    "araquanid": 27,
    "arbok": 28,
    "arcanine": 29,
    "arcaninehisui": 30,
    "archaludon": 31,
    "ariados": 32,
    "armarouge": 33,
    "aromatisse": 34,
    "audino": 35,
    "audinomega": 36,
    "aurorus": 37,
    "avalugg": 38,
    "avalugghisui": 39,
    "azumarill": 40,
    "banette": 41,
    "banettemega": 42,
    "barbaracle": 43,
    "barbaraclemega": 44,
    "basculegion": 45,
    "basculegionf": 46,
    "bastiodon": 47,
    "beartic": 48,
    "beedrill": 49,
    "beedrillmega": 50,
    "bellibolt": 51,
    "blastoise": 52,
    "blastoisemega": 53,
    "blaziken": 54,
    "blazikenmega": 55,
    "camerupt": 56,
    "cameruptmega": 57,
    "castform": 58,
    "castformrainy": 59,
    "castformsnowy": 60,
    "castformsunny": 61,
    "ceruledge": 62,
    "chandelure": 63,
    "chandeluremega": 64,
    "charizard": 65,
    "charizardmegax": 66,
    "charizardmegay": 67,
    "chesnaught": 68,
    "chesnaughtmega": 69,
    "chimecho": 70,
    "chimechomega": 71,
    "clawitzer": 72,
    "clefable": 73,
    "clefablemega": 74,
    "cofagrigus": 75,
    "conkeldurr": 76,
    "corviknight": 77,
    "crabominable": 78,
    "crabominablemega": 79,
    "cramorantgorging": 80,
    "cramorantgulping": 81,
    "decidueye": 82,
    "decidueyehisui": 83,
    "dedenne": 84,
    "delphox": 85,
    "delphoxmega": 86,
    "diggersby": 87,
    "ditto": 88,
    "dragalge": 89,
    "dragalgemega": 90,
    "dragapult": 91,
    "dragonite": 92,
    "dragonitemega": 93,
    "drampa": 94,
    "drampamega": 95,
    "eelektross": 96,
    "eelektrossmega": 97,
    "eiscuenoice": 98,
    "emboar": 99,
    "emboarmega": 100,
    "emolga": 101,
    "empoleon": 102,
    "espathra": 103,
    "espeon": 104,
    "excadrill": 105,
    "excadrillmega": 106,
    "falinks": 107,
    "falinksmega": 108,
    "farigiraf": 109,
    "feraligatr": 110,
    "feraligatrmega": 111,
    "flapple": 112,
    "flareon": 113,
    "floetteeternal": 114,
    "floettemega": 115,
    "florges": 116,
    "forretress": 117,
    "froslass": 118,
    "froslassmega": 119,
    "furfrou": 120,
    "gallade": 121,
    "gallademega": 122,
    "garbodor": 123,
    "garchomp": 124,
    "garchompmega": 125,
    "gardevoir": 126,
    "gardevoirmega": 127,
    "garganacl": 128,
    "gengar": 129,
    "gengarmega": 130,
    "gholdengo": 131,
    "glaceon": 132,
    "glalie": 133,
    "glaliemega": 134,
    "glimmora": 135,
    "glimmoramega": 136,
    "gliscor": 137,
    "golurk": 138,
    "golurkmega": 139,
    "goodra": 140,
    "goodrahisui": 141,
    "gourgeist": 142,
    "gourgeistlarge": 143,
    "gourgeistsmall": 144,
    "gourgeistsuper": 145,
    "greninja": 146,
    "greninjamega": 147,
    "grimmsnarl": 148,
    "gyarados": 149,
    "gyaradosmega": 150,
    "hatterene": 151,
    "hawlucha": 152,
    "hawluchamega": 153,
    "heliolisk": 154,
    "heracross": 155,
    "heracrossmega": 156,
    "hippowdon": 157,
    "houndoom": 158,
    "houndoommega": 159,
    "houndstone": 160,
    "hydrapple": 161,
    "hydreigon": 162,
    "incineroar": 163,
    "infernape": 164,
    "jolteon": 165,
    "kangaskhan": 166,
    "kangaskhanmega": 167,
    "kingambit": 168,
    "kleavor": 169,
    "klefki": 170,
    "kommoo": 171,
    "krookodile": 172,
    "leafeon": 173,
    "liepard": 174,
    "lopunny": 175,
    "lopunnymega": 176,
    "lucario": 177,
    "lucariomega": 178,
    "luxray": 179,
    "lycanroc": 180,
    "lycanrocdusk": 181,
    "lycanrocmidnight": 182,
    "machamp": 183,
    "malamar": 184,
    "malamarmega": 185,
    "mamoswine": 186,
    "manectric": 187,
    "manectricmega": 188,
    "maushold": 189,
    "mausholdfour": 190,
    "mawile": 191,
    "mawilemega": 192,
    "medicham": 193,
    "medichammega": 194,
    "meganium": 195,
    "meganiummega": 196,
    "meowscarada": 197,
    "meowstic": 198,
    "meowsticf": 199,
    "meowsticfmega": 200,
    "meowsticmmega": 201,
    "metagross": 202,
    "metagrossmega": 203,
    "milotic": 204,
    "mimikyu": 205,
    "mimikyubusted": 206,
    "miniormeteor": 207,
    "morpeko": 208,
    "morpekohangry": 209,
    "mrrime": 210,
    "mudsdale": 211,
    "musharna": 212,
    "ninetales": 213,
    "ninetalesalola": 214,
    "noivern": 215,
    "ogerponcornerstonetera": 216,
    "ogerponhearthflametera": 217,
    "ogerpontealtera": 218,
    "ogerponwellspringtera": 219,
    "oranguru": 220,
    "orthworm": 221,
    "overqwil": 222,
    "palafin": 223,
    "palafinhero": 224,
    "pangoro": 225,
    "passimian": 226,
    "pelipper": 227,
    "pidgeot": 228,
    "pidgeotmega": 229,
    "pikachu": 230,
    "pinsir": 231,
    "pinsirmega": 232,
    "politoed": 233,
    "polteageist": 234,
    "polteageistantique": 235,
    "primarina": 236,
    "pyroar": 237,
    "pyroarmega": 238,
    "quaquaval": 239,
    "qwilfish": 240,
    "raichu": 241,
    "raichualola": 242,
    "raichumegax": 243,
    "raichumegay": 244,
    "rampardos": 245,
    "reuniclus": 246,
    "rhyperior": 247,
    "roserade": 248,
    "rotom": 249,
    "rotomfan": 250,
    "rotomfrost": 251,
    "rotomheat": 252,
    "rotommow": 253,
    "rotomwash": 254,
    "runerigus": 255,
    "sableye": 256,
    "sableyemega": 257,
    "salazzle": 258,
    "samurott": 259,
    "samurotthisui": 260,
    "sandaconda": 261,
    "sceptile": 262,
    "sceptilemega": 263,
    "scizor": 264,
    "scizormega": 265,
    "scolipede": 266,
    "scolipedemega": 267,
    "scovillain": 268,
    "scovillainmega": 269,
    "scrafty": 270,
    "scraftymega": 271,
    "serperior": 272,
    "sharpedo": 273,
    "sharpedomega": 274,
    "simipour": 275,
    "simisage": 276,
    "simisear": 277,
    "sinistcha": 278,
    "sinistchamasterpiece": 279,
    "skarmory": 280,
    "skarmorymega": 281,
    "skeledirge": 282,
    "slowbro": 283,
    "slowbrogalar": 284,
    "slowbromega": 285,
    "slowking": 286,
    "slowkinggalar": 287,
    "slurpuff": 288,
    "sneasler": 289,
    "snorlax": 290,
    "spiritomb": 291,
    "staraptor": 292,
    "staraptormega": 293,
    "starmie": 294,
    "starmiemega": 295,
    "steelix": 296,
    "steelixmega": 297,
    "stunfisk": 298,
    "stunfiskgalar": 299,
    "swampert": 300,
    "swampertmega": 301,
    "sylveon": 302,
    "talonflame": 303,
    "tauros": 304,
    "taurospaldeaaqua": 305,
    "taurospaldeablaze": 306,
    "taurospaldeacombat": 307,
    "tinkaton": 308,
    "torkoal": 309,
    "torterra": 310,
    "toucannon": 311,
    "toxapex": 312,
    "toxicroak": 313,
    "trevenant": 314,
    "tsareena": 315,
    "typhlosion": 316,
    "typhlosionhisui": 317,
    "tyranitar": 318,
    "tyranitarmega": 319,
    "tyrantrum": 320,
    "umbreon": 321,
    "vanilluxe": 322,
    "vaporeon": 323,
    "venusaur": 324,
    "venusaurmega": 325,
    "victreebel": 326,
    "victreebelmega": 327,
    "vileplume": 328,
    "vivillon": 329,
    "vivillonarchipelago": 330,
    "vivilloncontinental": 331,
    "vivillonelegant": 332,
    "vivillonfancy": 333,
    "vivillongarden": 334,
    "vivillonhighplains": 335,
    "vivillonicysnow": 336,
    "vivillonjungle": 337,
    "vivillonmarine": 338,
    "vivillonmodern": 339,
    "vivillonmonsoon": 340,
    "vivillonocean": 341,
    "vivillonpokeball": 342,
    "vivillonpolar": 343,
    "vivillonriver": 344,
    "vivillonsandstorm": 345,
    "vivillonsavanna": 346,
    "vivillonsun": 347,
    "vivillontundra": 348,
    "volcarona": 349,
    "watchog": 350,
    "weavile": 351,
    "whimsicott": 352,
    "wyrdeer": 353,
    "zoroark": 354,
    "zoroarkhisui": 355
  },
  "status": {
    "brn": 1,
    "fnt": 2,
    "frz": 3,
    "par": 4,
    "psn": 5,
    "slp": 6,
    "tox": 7
  },
  "trickroom": {
    "trickroom": 1
  },
  "types": {
    "bug": 1,
    "dark": 2,
    "dragon": 3,
    "electric": 4,
    "fairy": 5,
    "fighting": 6,
    "fire": 7,
    "flying": 8,
    "ghost": 9,
    "grass": 10,
    "ground": 11,
    "ice": 12,
    "normal": 13,
    "poison": 14,
    "psychic": 15,
    "rock": 16,
    "steel": 17,
    "water": 18
  },
  "volatiles": {
    "aftermath": 1,
    "afteryou": 2,
    "allyswitch": 224,
    "aquaring": 3,
    "aromatherapy": 4,
    "aromaveil": 5,
    "attract": 6,
    "autotomize": 7,
    "baddreams": 8,
    "banefulbunker": 9,
    "battlebond": 10,
    "beakblast": 11,
    "bide": 12,
    "bind": 13,
    "burningbulwark": 14,
    "burnup": 15,
    "celebrate": 16,
    "charge": 17,
    "chillyreception": 225,
    "choicelock": 226,
    "clamp": 18,
    "commander": 19,
    "confusion": 20,
    "counter": 227,
    "courtchange": 21,
    "craftyshield": 22,
    "cudchew": 23,
    "curse": 24,
    "custapberry": 25,
    "dancer": 26,
    "defensecurl": 27,
    "destinybond": 28,
    "disable": 29,
    "disguise": 30,
    "doomdesire": 31,
    "dragoncheer": 32,
    "dynamax": 33,
    "eeriespell": 34,
    "electricterrain": 35,
    "electrify": 36,
    "embargo": 37,
    "emergencyexit": 38,
    "encore": 39,
    "endure": 40,
    "fairylock": 41,
    "fallen": 42,
    "fallen1": 43,
    "fallen2": 44,
    "fallen3": 45,
    "fallen4": 46,
    "fallen5": 47,
    "feint": 48,
    "ficklebeam": 49,
    "firespin": 50,
    "flashfire": 51,
    "flinch": 52,
    "fling": 228,
    "flowerveil": 53,
    "focusband": 54,
    "focusenergy": 55,
    "focuspunch": 56,
    "followme": 57,
    "foresight": 58,
    "forewarn": 59,
    "futuresight": 60,
    "gastroacid": 61,
    "glaiverush": 62,
    "gmaxcentiferno": 63,
    "gmaxchistrike": 64,
    "gmaxoneblow": 65,
    "gmaxrapidflow": 66,
    "gmaxsandblast": 67,
    "gravity": 68,
    "grudge": 69,
    "guarddog": 70,
    "guardsplit": 71,
    "gulpmissile": 72,
    "hadronengine": 73,
    "healbell": 74,
    "healblock": 75,
    "healer": 76,
    "helpinghand": 77,
    "hydration": 78,
    "hyperspacefury": 79,
    "hyperspacehole": 80,
    "iceface": 81,
    "illusion": 82,
    "immunity": 83,
    "imprison": 84,
    "infestation": 85,
    "ingrain": 86,
    "innardsout": 87,
    "insomnia": 88,
    "instruct": 89,
    "ironbarbs": 90,
    "kingsshield": 91,
    "laserfocus": 92,
    "leechseed": 93,
    "leppaberry": 94,
    "lightningrod": 95,
    "limber": 96,
    "lingeringaroma": 97,
    "liquidooze": 98,
    "lockedmove": 99,
    "lockon": 100,
    "magiccoat": 101,
    "magmastorm": 102,
    "magnetrise": 103,
    "magnitude": 104,
    "matblock": 105,
    "maxguard": 106,
    "metronome": 229,
    "mimic": 107,
    "mimicry": 108,
    "mindreader": 109,
    "minimize": 110,
    "miracleeye": 111,
    "mirrorcoat": 230,
    "mist": 112,
    "mistyterrain": 113,
    "mummy": 114,
    "mustrecharge": 115,
    "nightmare": 116,
    "noretreat": 117,
    "oblivious": 118,
    "obstruct": 119,
    "octolock": 120,
    "orichalcumpulse": 121,
    "owntempo": 122,
    "partiallytrapped": 123,
    "pastelveil": 124,
    "perish0": 125,
    "perish1": 126,
    "perish2": 127,
    "perish3": 128,
    "perishsong": 231,
    "phantomforce": 129,
    "poltergeist": 130,
    "powder": 131,
    "powerconstruct": 132,
    "powershift": 133,
    "powersplit": 134,
    "powertrick": 135,
    "protect": 136,
    "protectivepads": 137,
    "protosynthesis": 138,
    "protosynthesisatk": 139,
    "protosynthesisdef": 140,
    "protosynthesisspa": 141,
    "protosynthesisspd": 142,
    "protosynthesisspe": 143,
    "psychicterrain": 144,
    "pursuit": 145,
    "quarkdrive": 146,
    "quarkdriveatk": 147,
    "quarkdrivedef": 148,
    "quarkdrivespa": 149,
    "quarkdrivespd": 150,
    "quarkdrivespe": 151,
    "quash": 152,
    "quickclaw": 153,
    "quickdraw": 154,
    "quickguard": 155,
    "rage": 156,
    "ragepowder": 157,
    "reflect": 158,
    "ripen": 159,
    "roost": 160,
    "roughskin": 161,
    "safeguard": 162,
    "safetygoggles": 163,
    "saltcure": 164,
    "sandtomb": 165,
    "screencleaner": 166,
    "shadowforce": 167,
    "shedskin": 168,
    "silktrap": 169,
    "sketch": 170,
    "skillswap": 171,
    "skydrop": 172,
    "slowstart": 173,
    "smackdown": 174,
    "snaptrap": 175,
    "snatch": 176,
    "sparklingaria": 177,
    "speedswap": 178,
    "spikyshield": 179,
    "spite": 180,
    "spotlight": 181,
    "stall": 232,
    "stickyhold": 182,
    "stickyweb": 183,
    "stockpile": 184,
    "stockpile1": 185,
    "stockpile2": 186,
    "stockpile3": 187,
    "stormdrain": 188,
    "struggle": 189,
    "substitute": 190,
    "suctioncups": 191,
    "supremeoverlord": 192,
    "sweetveil": 193,
    "symbiosis": 194,
    "synchronize": 195,
    "syrupbomb": 196,
    "tarshot": 197,
    "taunt": 198,
    "telekinesis": 199,
    "telepathy": 200,
    "terashell": 201,
    "terashift": 202,
    "thermalexchange": 203,
    "throatchop": 204,
    "thundercage": 205,
    "tidyup": 206,
    "torment": 207,
    "toxicdebris": 208,
    "trapped": 209,
    "trick": 210,
    "twoturnmove": 233,
    "typeadd": 211,
    "typechange": 212,
    "unburden": 234,
    "uproar": 213,
    "vitalspirit": 214,
    "wanderingspirit": 215,
    "waterbubble": 216,
    "waterveil": 217,
    "whirlpool": 218,
    "wideguard": 219,
    "wimpout": 220,
    "wrap": 221,
    "yawn": 222,
    "zerotohero": 223
  },
  "weathers": {
    "deltastream": 1,
    "desolateland": 2,
    "hail": 3,
    "primordialsea": 4,
    "raindance": 5,
    "sandstorm": 6,
    "snowscape": 7,
    "sunnyday": 8
  }
}
